jhirsi/sdk-nrf/drivers/dect_nrp/nrf91_mac/dect_nrf91_ctrl.c
/*
 * Copyright (c) 2025 Nordic Semiconductor ASA
 *
 * SPDX-License-Identifier: LicenseRef-Nordic-5-Clause
 */

#include <zephyr/sys/byteorder.h>

#include <zephyr/kernel.h>
#include <zephyr/init.h>
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
#include <zephyr/shell/shell.h>

#include <modem/nrf_modem_lib.h>
#include <nrf_modem_at.h>

#include <nrf_errno.h>
#include <nrf_modem_dect_mac.h>

#include <net/dect_nrp_utils.h>

#include <dect_net_l2_mgmt.h>

#include "dect_nrf91_common.h"
#include "dect_nrf91_utils.h"
#include "dect_nrf91_settings.h"
#include "dect_nrf91.h"
#include "dect_nrf91_rx.h"
#include "dect_nrf91_sink.h"
#include "dect_nrf91_ctrl.h"

#include <zephyr/logging/log.h>
LOG_MODULE_DECLARE(DECT_NRP_MAC, CONFIG_DECT_NRP_MAC_LOG_LEVEL);

#include "net_private.h" /* For net_sprint_ipv6_addr */

K_SEM_DEFINE(dect_mac_libmodem_api_sema, 0, 1);
K_SEM_DEFINE(dect_mac_ctrl_reactivate_sema, 0, 1);

K_MUTEX_DEFINE(dect_mac_ctrl_data_mtx);
typedef enum {
	CTRL_PT_ASSOCIATION_STATE_NONE,
	CTRL_PT_ASSOCIATION_STATE_CLUSTER_FOUND,
	CTRL_PT_ASSOCIATION_STATE_CLUSTER_BEACON_RECEIVED,
	CTRL_PT_ASSOCIATION_STATE_ASSOCIATED,
} ctrl_pt_association_state_t;

typedef enum {
	CTRL_FT_CLUSTER_STATE_NONE = 0,
	CTRL_FT_CLUSTER_STATE_STARTING,
	CTRL_FT_CLUSTER_STATE_STARTED,
} ctrl_ft_cluster_state_t;

typedef enum {
	CTRL_FT_NW_BEACON_STATE_NONE = 0,
	CTRL_FT_NW_BEACON_STATE_STARTING,
	CTRL_FT_NW_BEACON_STATE_STARTED,
	CTRL_FT_NW_BEACON_STATE_STOPPING,
} ctrl_ft_nw_beacon_state_t;

typedef enum {
	CTRL_FT_NETWORK_STATE_NONE = 0,
	CTRL_FT_NETWORK_STATE_STARTING,
	CTRL_FT_NETWORK_STATE_CREATED,
} ctrl_ft_network_state_t;

typedef struct {
	ctrl_pt_association_state_t pt_association_state;

	uint32_t parent_long_rd_id;
	uint32_t network_id;
	uint16_t channel;
} ctrl_pt_association_config_t;

struct dect_nrf91_ctrl_rssi_scan_result_data {
	uint16_t channel;

	bool another_cluster_detected_in_channel;
	bool all_subslots_free;
	uint8_t busy_percentage;
	bool busy_percentage_ok;
	bool scan_suitable_percent_ok;

	uint8_t possible_subslot_cnt;
	uint8_t busy_subslot_cnt;
};

#define DECT_NRF91_CTRL_RSSI_SCAN_RESULTS_MAX_CHANNELS 30

struct dect_nrf91_ctrl_rssi_scan_data {
	bool cmd_on_going; /* actual RSSI command */

	uint8_t current_results_index;
	struct dect_nrf91_ctrl_rssi_scan_result_data results[
		DECT_NRF91_CTRL_RSSI_SCAN_RESULTS_MAX_CHANNELS];
};

#define DECT_NRF91_CTRL_CLUSTER_SCAN_DATA_MAX_CHANNELS 30
struct dect_nrf91_ctrl_cluster_channel_list_item {
	uint32_t long_rd_id;
	uint16_t channel;
	int8_t rssi_2;

};

struct dect_nrf91_ctrl_scan_data {
	bool on_going;

	/* Storage for channels where we have seen cluster */
	struct dect_nrf91_ctrl_cluster_channel_list_item
		cluster_channels[
			DECT_NRF91_CTRL_CLUSTER_SCAN_DATA_MAX_CHANNELS];
	uint8_t current_cluster_channel_index;

	dect_scan_result_cb_t scan_result_cb;
	struct nrf_modem_dect_mac_network_scan_params scan_params;
};

typedef enum {
	CTRL_MDM_DEACTIVATED = 0,
	CTRL_MDM_ACTIVATE_REQ,
	CTRL_MDM_ACTIVATED,
	CTRL_MDM_DEACTIVATE_REQ,
	CTRL_MDM_REACTIVATING_DEACTIVATE,
	CTRL_MDM_REACTIVATING_CONFIGURE,
} ctrl_mdm_activation_state_t;

struct dect_nrf91_ctrl_dlc_data_tx_info {
	uint32_t transaction_id;
	uint32_t data_len;
	bool req_on_going;
};

typedef struct {
	bool debug;

	bool power_save;
	bool auto_start;
	bool auto_activate;

	int8_t tx_pwr;
	uint8_t tx_mcs;
	uint8_t band;
	uint8_t band_group_index;

	uint16_t channel;

	uint32_t long_rd_id;
	uint32_t network_id;
} dect_nrf91_ctrl_configure_params_t;


/* States of all commands */
/* TODO: better hierarchy for state data? */
static struct dect_nrf91_ctrl_data {
	bool debug;

	struct nrf_modem_dect_mac_capability_ntf_cb_params mdm_capas;

	/* TODO: do we need both of following two?*/
	ctrl_ft_cluster_state_t ft_cluster_state;
	ctrl_ft_network_state_t ft_network_state;
	ctrl_ft_nw_beacon_state_t ft_nw_beacon_state;
	uint16_t ft_requested_cluster_channel;

	uint16_t ft_cluster_reconfig_prev_cluster_channel;
	struct dect_cluster_reconfig_req_params ft_cluster_reconfig_params;
	bool ft_cluster_reconfig_ongoing;

	ctrl_mdm_activation_state_t mdm_activation_state;

	ctrl_pt_association_config_t ass_config;
	enum nrf_modem_dect_mac_release_cause last_rel_cause;

	struct dect_nrf91_ctrl_rssi_scan_data rssi_scan_data;
	struct dect_nrf91_ctrl_scan_data scan_data;
	dect_nrf91_ctrl_configure_params_t configure_params;

	bool tx_mdm_flow_ctrl_on;
#if defined(CONFIG_DECT_NRP_MAC_NRF_TX_FLOW_CTRL_BASED_ON_MDM_TX_DLC_REQS)
	uint32_t total_unacked_tx_data_amount;
	uint16_t total_unacked_req_amount;
	struct dect_nrf91_ctrl_dlc_data_tx_info
		dlc_data_tx_infos[DECT_NRF91_DLC_DATA_INFO_MAX_COUNT];
#endif
	struct net_if *iface;
} ctrl_data;

/**************************************************************************************************/

struct dect_nrf91_ctrl_rssi_measurement_data_evt {
	struct nrf_modem_dect_mac_rssi_result rssi_result;
};

#define DECT_NRF91_MAX_NEIGHBOR_LIST_COUNT 50
struct dect_nrf91_ctrl_neighbor_list_resp_evt {
	int status;
	uint8_t num_neighbors;
	uint32_t neighbor_long_rd_ids[DECT_NRF91_MAX_NEIGHBOR_LIST_COUNT];
};

struct dect_nrf91_ctrl_dlc_data_tx_evt_data_item {
	uint32_t transaction_id;
};
struct dect_nrf91_ctrl_dlc_data_tx_resp_evt {
	enum nrf_modem_dect_mac_err status;
	uint8_t flow_id;
	uint32_t long_rd_id;

	uint8_t num_acked_data;
#if defined(CONFIG_DECT_NRP_MAC_MDM_BUNDLED_TX_RESPS)
	struct dect_nrf91_ctrl_dlc_data_tx_evt_data_item
		acked_data[DECT_NRF91_DLC_DATA_INFO_MAX_COUNT];
#else
	struct dect_nrf91_ctrl_dlc_data_tx_evt_data_item acked_data[1];
#endif
};

/**************************************************************************************************/

static void dect_nrf91_ctrl_rssi_scan_data_init(bool actual_command)
{
	ctrl_data.rssi_scan_data.cmd_on_going = actual_command;
	memset(&ctrl_data.rssi_scan_data.results, 0,
	       sizeof(ctrl_data.rssi_scan_data.results));
	ctrl_data.rssi_scan_data.current_results_index = 0;
}

static bool dect_nrf91_ctrl_rssi_scan_data_results_best_get(
	struct dect_nrf91_ctrl_rssi_scan_result_data *rssi_data_out)
{
	bool cont = false;
	const struct dect_nrf91_ctrl_rssi_scan_result_data *current_best = NULL;

	for (int i = 0; i < DECT_NRF91_CTRL_RSSI_SCAN_RESULTS_MAX_CHANNELS; i++) {
		const struct dect_nrf91_ctrl_rssi_scan_result_data *res =
			&ctrl_data.rssi_scan_data.results[i];

