jhirsi/sdk-nrf/drivers/dect_nrp/nrf91_mac/dect_nrf91_ctrl.c
		if (res->channel == 0) {
			continue;
		}
		/* Min requirement */
		if (res->scan_suitable_percent_ok) {
			cont = true;
			break;
		}
	}
	if (!cont) {
		return false;
	}

	/* MAC spec, ch. 5.1.2:
	 * after measuring the supported channels,
	 * the RD should select an operating channel(s) or consecutive operating
	 * channels in the following manner:
	 */
	/* 1st: if any channel where all subslots are "free", is found:
	 * Note: we have some extra checks here to search the best of "all free"
	 */
	for (int i = 0; i < DECT_NRF91_CTRL_RSSI_SCAN_RESULTS_MAX_CHANNELS; i++) {
		const struct dect_nrf91_ctrl_rssi_scan_result_data *res =
			&ctrl_data.rssi_scan_data.results[i];

		if (res->all_subslots_free && res->busy_percentage == 0 &&
		    res->another_cluster_detected_in_channel == false) {
			current_best = res;
			goto exit;
		}
	}
	for (int i = 0; i < DECT_NRF91_CTRL_RSSI_SCAN_RESULTS_MAX_CHANNELS; i++) {
		const struct dect_nrf91_ctrl_rssi_scan_result_data *res =
			&ctrl_data.rssi_scan_data.results[i];

		if (res->all_subslots_free && res->busy_percentage_ok &&
		    res->another_cluster_detected_in_channel == false) {
			current_best = res;
			goto exit;
		}
	}
	for (int i = 0; i < DECT_NRF91_CTRL_RSSI_SCAN_RESULTS_MAX_CHANNELS; i++) {
		const struct dect_nrf91_ctrl_rssi_scan_result_data *res =
			&ctrl_data.rssi_scan_data.results[i];

		if (res->all_subslots_free && res->busy_percentage == 0) {
			current_best = res;
			goto exit;
		}
	}
	for (int i = 0; i < DECT_NRF91_CTRL_RSSI_SCAN_RESULTS_MAX_CHANNELS; i++) {
		const struct dect_nrf91_ctrl_rssi_scan_result_data *res =
			&ctrl_data.rssi_scan_data.results[i];

		if (res->all_subslots_free && res->another_cluster_detected_in_channel == false) {
			current_best = res;
			goto exit;
		}
	}
	for (int i = 0; i < DECT_NRF91_CTRL_RSSI_SCAN_RESULTS_MAX_CHANNELS; i++) {
		const struct dect_nrf91_ctrl_rssi_scan_result_data *res =
			&ctrl_data.rssi_scan_data.results[i];

		if (res->all_subslots_free) {
			current_best = res;
			goto exit;
		}
	}

	/* 2nd: select the channel that has the lowest number of "busy" subslots */
	uint8_t min_busy_subslots = UINT8_MAX;

	for (int i = 0; i < DECT_NRF91_CTRL_RSSI_SCAN_RESULTS_MAX_CHANNELS; i++) {
		const struct dect_nrf91_ctrl_rssi_scan_result_data *res =
			&ctrl_data.rssi_scan_data.results[i];

		if (res->busy_subslot_cnt < min_busy_subslots) {
			min_busy_subslots = res->busy_subslot_cnt;
			current_best = res;
		}
	}
	uint16_t same_best_busy_subslots_count = 0;
	uint16_t best_possible_subslots_count = 10000; /* Lower the better */

	for (int i = 0; i < DECT_NRF91_CTRL_RSSI_SCAN_RESULTS_MAX_CHANNELS; i++) {
		const struct dect_nrf91_ctrl_rssi_scan_result_data *res =
			&ctrl_data.rssi_scan_data.results[i];

		if (res->busy_subslot_cnt == min_busy_subslots) {
			same_best_busy_subslots_count++;
		}
	}
	/* if multiple channels or consecutive channels have the same number of "busy" subslots: */
	if (same_best_busy_subslots_count > 1) {
		/* 2b: then select the channel that has the lowest number of "possible" subslots */
		for (int i = 0; i < DECT_NRF91_CTRL_RSSI_SCAN_RESULTS_MAX_CHANNELS; i++) {
			const struct dect_nrf91_ctrl_rssi_scan_result_data *res =
				&ctrl_data.rssi_scan_data.results[i];

			if (res->busy_subslot_cnt == min_busy_subslots) {
				if (res->possible_subslot_cnt < best_possible_subslots_count) {
					best_possible_subslots_count = res->possible_subslot_cnt;
					current_best = res;
				}
			}
		}
	}
exit:
	if (current_best != NULL) {
		*rssi_data_out = *current_best;
		return true;
	}
	return false;
}

/**************************************************************************************************/

static bool dect_nrf91_ctrl_cluster_channels_list_channel_exists(uint16_t channel)
{
	for (int i = 0; i < DECT_NRF91_CTRL_CLUSTER_SCAN_DATA_MAX_CHANNELS; i++) {
		if (ctrl_data.scan_data.cluster_channels[i].channel == channel) {
			return true;
		}
	}
	return false;
}

static bool dect_nrf91_ctrl_cluster_channels_list_best_channel_get(
	struct dect_nrf91_ctrl_cluster_channel_list_item *best_channel_data_out)
{
	if (ctrl_data.scan_data.current_cluster_channel_index == 0 &&
	    ctrl_data.scan_data.cluster_channels[0].channel == 0) {
		LOG_WRN("No cluster channels stored");
		return false;
	}
	int8_t best_rssi = ctrl_data.scan_data.cluster_channels[0].rssi_2;
	uint16_t best_channel = ctrl_data.scan_data.cluster_channels[0].channel;
	uint32_t best_long_rd_id = ctrl_data.scan_data.cluster_channels[0].long_rd_id;

	for (int i = 1; i < ctrl_data.scan_data.current_cluster_channel_index; i++) {
		if (ctrl_data.scan_data.cluster_channels[i].rssi_2 > best_rssi) {
			best_rssi = ctrl_data.scan_data.cluster_channels[i].rssi_2;
			best_channel = ctrl_data.scan_data.cluster_channels[i].channel;
			best_long_rd_id = ctrl_data.scan_data.cluster_channels[i].long_rd_id;
		}
	}
	best_channel_data_out->rssi_2 = best_rssi;
	best_channel_data_out->channel = best_channel;
	best_channel_data_out->long_rd_id = best_long_rd_id;
	LOG_DBG("Best channel found: %d (RSSI: %d, long rd id %u)",
		best_channel, best_rssi, best_long_rd_id);
	return true;
}

/**************************************************************************************************/

struct dect_mac_common_op_event_msgq_item {
	dect_nrf91_ctrl_op_t id;
	void *data;
};

K_MSGQ_DEFINE(dect_nrf91_ctrl_msgq, sizeof(struct dect_mac_common_op_event_msgq_item), 1000,
	      4); /* TODO optimize sizes */

static int dect_nrf91_ctrl_msgq_non_data_op_add(dect_nrf91_ctrl_op_t event_id)
{
	int ret = 0;
	struct dect_mac_common_op_event_msgq_item event;

	event.id = event_id;
	event.data = NULL;
	ret = k_msgq_put(&dect_nrf91_ctrl_msgq, &event, K_NO_WAIT);
	if (ret) {
		k_free(event.data);
		return -ENOBUFS;
	}
	return 0;
}

static int dect_nrf91_ctrl_msgq_data_op_add(
	dect_nrf91_ctrl_op_t event_id, void *data, size_t data_size)
{
	int ret = 0;
	struct dect_mac_common_op_event_msgq_item event;

	event.data = k_malloc(data_size);
	if (event.data == NULL) {
		return -ENOMEM;
	}
	memcpy(event.data, data, data_size);
	event.id = event_id;

