jhirsi/sdk-nrf/drivers/dect_nrp/nrf91_mac/dect_nrf91_ctrl.c
	ret = k_msgq_put(&dect_nrf91_ctrl_msgq, &event, K_NO_WAIT);
	if (ret) {
		k_free(event.data);
		return -ENOBUFS;
	}
	return 0;
}

/**************************************************************************************************/

int dect_nrf91_ctrl_api_cluster_channel_get(void)
{
	if (ctrl_data.ft_cluster_state == CTRL_FT_CLUSTER_STATE_STARTED) {
		return ctrl_data.configure_params.channel;
	} else {
		return -EINVAL;
	}
}

bool dect_nrf91_ctrl_api_nw_beacon_running(void)
{
	if (ctrl_data.ft_nw_beacon_state == CTRL_FT_NW_BEACON_STATE_STARTED) {
		return true;
	} else {
		return false;
	}
}

bool dect_nrf91_ctrl_api_mdm_activated(void)
{
	if (ctrl_data.mdm_activation_state == CTRL_MDM_ACTIVATED) {
		return true;
	} else {
		return false;
	}
}

static bool dect_nrf91_ctrl_connected(void) /* Cluster running or associated */
{
	if (ctrl_data.ft_cluster_state != CTRL_FT_CLUSTER_STATE_NONE ||
	    ctrl_data.ass_config.pt_association_state != CTRL_PT_ASSOCIATION_STATE_NONE) {
		return true;
	} else {
		return false;
	}
}

/**************************************************************************************************/

static int dect_nrf91_ctrl_configure_cmd(dect_nrf91_ctrl_configure_params_t *params)
{
	struct dect_nrf91_settings *set_ptr = dect_nrf91_settings_ref_get();

	ctrl_data.configure_params = *params;

	struct nrf_modem_dect_control_configure_params config = {
		.max_tx_power = dect_nrp_utils_dbm_to_phy_tx_power(params->tx_pwr),
		.expected_mcs1_rx_rssi_level = CONFIG_DECT_NRP_MAC_NRF_RX_MCS1_EXPECTED_RSSI_LEVEL,
		.max_mcs = params->tx_mcs,
		.long_rd_id = params->long_rd_id,
		.phy_band_group_index = params->band_group_index,
		.power_save = params->power_save,
		.security.mode = set_ptr->net_mgmt_common.sec_conf.mode,
		.stats_averaging_length = 2,
	};
	int err;

	if (set_ptr->net_mgmt_common.sec_conf.mode != DECT_MAC_SECURITY_MODE_NONE) {
		memcpy(config.security.integrity_key,
		       set_ptr->net_mgmt_common.sec_conf.integrity_key,
		       NRF_MODEM_DECT_MAC_INTEGRITY_KEY_LENGTH);
		memcpy(config.security.cipher_key, set_ptr->net_mgmt_common.sec_conf.cipher_key,
		       NRF_MODEM_DECT_MAC_CIPHER_KEY_LENGTH);
	}
	err = nrf_modem_dect_control_configure(&config);
	if (err) {
		LOG_ERR("nrf_modem_dect_control_configure() failed, error: %d", err);
	}
	return err;
}

static int dect_nrf91_ctrl_modem_configure_req_from_settings(void)
{
	dect_nrf91_ctrl_configure_params_t params;
	struct dect_nrf91_settings *set_ptr = dect_nrf91_settings_ref_get();
	int ret;

	if (ctrl_data.mdm_activation_state != CTRL_MDM_DEACTIVATED) {
		LOG_ERR("Modem is not deactivated, cannot configure");
		return -EINVAL;
	}
	params.long_rd_id = set_ptr->net_mgmt_common.identities.transmitter_long_rd_id;
	params.network_id = set_ptr->net_mgmt_common.identities.network_id;
	params.band = set_ptr->net_mgmt_common.band_nbr;
	params.band_group_index = 0;
	if (params.band == 4) {
		params.band_group_index = 1;
	}

	params.debug = false;

	params.tx_mcs = set_ptr->net_mgmt_common.tx.max_mcs;
	params.auto_start = false;
	params.auto_activate = set_ptr->net_mgmt_common.auto_start.activate;
	params.channel = 0;
	params.power_save = set_ptr->net_mgmt_common.power_save;
	params.tx_pwr = set_ptr->net_mgmt_common.tx.max_power_dbm;

	/* Init reconfigure params */
	ctrl_data.ft_cluster_reconfig_params.channel = 0;
	ctrl_data.ft_cluster_reconfig_params.max_beacon_tx_power_dbm =
		set_ptr->net_mgmt_common.cluster.max_beacon_tx_power_dbm;
	ctrl_data.ft_cluster_reconfig_params.max_cluster_power_dbm =
		set_ptr->net_mgmt_common.cluster.max_cluster_power_dbm;
	ctrl_data.ft_cluster_reconfig_params.period =
		set_ptr->net_mgmt_common.cluster.beacon_period;

	ret = dect_nrf91_ctrl_configure_cmd(&params);
	if (ret != 0) {
		printk("Error in configure, error: %d\n", ret);
	}
	return ret;
}

int dect_nrf91_ctrl_api_mdm_configure_n_activate(void)
{
	int ret = 0;

	if (ctrl_data.mdm_activation_state != CTRL_MDM_DEACTIVATED) {
		LOG_ERR("Modem is not deactivated, cannot configure");
		return -EINVAL;
	}
	ret = dect_nrf91_ctrl_modem_configure_req_from_settings();
	if (ret != 0) {
		LOG_ERR("%s: error in configure, error: %d", (__func__), ret);
	} else {
		ctrl_data.mdm_activation_state = CTRL_MDM_ACTIVATE_REQ;
	}
	return ret;
}

/**************************************************************************************************/

static int dect_nrf91_ctrl_mdm_activate_req(void)
{
	/* Activate modem by setting full functional mode */
	char tmp_str[128] = {0};
	int err = nrf_modem_dect_control_functional_mode_set(
		NRF_MODEM_DECT_CONTROL_FUNCTIONAL_MODE_ACTIVATE);

	if (err) {
		dect_nrf91_utils_modem_mac_err_to_string(err, tmp_str);
		LOG_ERR("%s: error in CFUN set: err %s (%d)", (__func__), tmp_str, err);
	}
	return err;
}

static int dect_nrf91_ctrl_mdm_deactivate_req(void)
{
	/* Deactivate modem by setting min functional mode */
	char tmp_str[128] = {0};
	int err = nrf_modem_dect_control_functional_mode_set(
		NRF_MODEM_DECT_CONTROL_FUNCTIONAL_MODE_DEACTIVATE);

	if (err) {
		dect_nrf91_utils_modem_mac_err_to_string(err, tmp_str);
		LOG_ERR("%s: error in CFUN set: err %s (%d)", (__func__), tmp_str, err);
	}
	return err;
}

int dect_nrf91_ctrl_api_mdm_deactivate(void)
{
	int ret;

	ret = dect_nrf91_ctrl_mdm_deactivate_req();
	if (ret != 0) {
		LOG_ERR("%s: error in deactivate, error: %d", (__func__), ret);
	} else {
		ctrl_data.mdm_activation_state = CTRL_MDM_DEACTIVATE_REQ;
	}
	return ret;
}

/**************************************************************************************************/

int dect_nrf91_ctrl_api_mdm_reactivate(void)
{
	if (ctrl_data.mdm_activation_state != CTRL_MDM_ACTIVATED) {
		LOG_DBG("Modem is not activated, cannot reactivate");
		return -EINVAL;
	}

	if (dect_nrf91_ctrl_connected()) {
		LOG_DBG("Modem is connected, cannot reactivate");
		return -EINVAL;
	}
	k_sem_reset(&dect_mac_ctrl_reactivate_sema);

	int ret = dect_nrf91_ctrl_mdm_deactivate_req();

	if (ret != 0) {
		LOG_ERR("%s: error in deactivate, error: %d", (__func__), ret);
	} else {
		ctrl_data.mdm_activation_state = CTRL_MDM_REACTIVATING_DEACTIVATE;
		LOG_INF("Modem deactivation requested, waiting for configure/reactivation");
	}

	/* Wait for reactivation */
	ret = k_sem_take(&dect_mac_ctrl_reactivate_sema, K_SECONDS(3));
	if (ret != 0) {
		LOG_ERR("%s: timeout in wait for reactivation, error: %d", (__func__), ret);
	}
	return ret;
}

