jhirsi/sdk-nrf/drivers/dect_nrp/nrf91_mac/dect_nrf91_ctrl.c
/**************************************************************************************************/

int dect_nrf91_ctrl_api_rssi_scan_start_cmd(struct nrf_modem_dect_mac_rssi_scan_params *params)
{
	if (ctrl_data.rssi_scan_data.cmd_on_going) {
		LOG_ERR("RSSI scan already on going");
		return -EALREADY;
	}
	int err = dect_nrf91_ctrl_msgq_data_op_add(
		DECT_NRF91_CTRL_OP_RSSI_START_REQ_CMD,
		params,
		sizeof(struct nrf_modem_dect_mac_rssi_scan_params));

	return err;
}

/**************************************************************************************************/

int dect_nrf91_ctrl_api_nw_scan_cmd(
	struct nrf_modem_dect_mac_network_scan_params *params, dect_scan_result_cb_t cb)
{
	if (ctrl_data.scan_data.on_going) {
		LOG_ERR("Network scan already on going");
		return -EALREADY;
	}
	int err = nrf_modem_dect_mac_network_scan(params);

	if (!err) {
		ctrl_data.scan_data.on_going = true;
		ctrl_data.scan_data.scan_result_cb = cb;
		ctrl_data.scan_data.scan_params = *params;
		memset(ctrl_data.scan_data.cluster_channels, 0,
		       sizeof(ctrl_data.scan_data.cluster_channels));
		ctrl_data.scan_data.current_cluster_channel_index = 0;
	}
	return err;
}

/**************************************************************************************************/

int dect_nrf91_ctrl_api_tx_cmd(dect_nrf91_ctrl_api_tx_cmd_params_t *params)
{
	struct nrf_modem_dect_dlc_data_tx_params tx_params = {
		.transaction_id = params->transaction_id,
		.flow_id = params->flow_id,
		.long_rd_id = params->long_rd_id,
		.data = params->data,
		.data_len = params->data_len,
	};
	int ret;

	k_mutex_lock(&dect_mac_ctrl_data_mtx, K_FOREVER);
	if (ctrl_data.tx_mdm_flow_ctrl_on) {
		LOG_DBG("Flow control is enabled, tx not allowed");
		k_mutex_unlock(&dect_mac_ctrl_data_mtx);
		return -EACCES;
	}
#if defined(CONFIG_DECT_NRP_MAC_NRF_TX_FLOW_CTRL_BASED_ON_MDM_TX_DLC_REQS)
	int arr_index = params->transaction_id - DECT_MAC_DATA_TX_HANDLE_START;

	if (ctrl_data.total_unacked_tx_data_amount + params->data_len >
	    CONFIG_NRF_MODEM_LIB_SHMEM_TX_SIZE) {
		LOG_WRN("Too much unacked TX data: %d bytes - continue but flow ctrl might occur",
			ctrl_data.total_unacked_tx_data_amount);
	}
	if (ctrl_data.total_unacked_req_amount >= DECT_MAC_DATA_TX_HANDLE_COUNT) {
		LOG_WRN("Too many unacked TX requests: %d", ctrl_data.total_unacked_req_amount);
		k_mutex_unlock(&dect_mac_ctrl_data_mtx);
		return -ENOMEM;
	}
	if (arr_index < 0 || arr_index >= DECT_NRF91_DLC_DATA_INFO_MAX_COUNT) {
		LOG_ERR("Invalid transaction ID: %d", params->transaction_id);
		k_mutex_unlock(&dect_mac_ctrl_data_mtx);
		return -EINVAL;
	}
	if (ctrl_data.dlc_data_tx_infos[arr_index].req_on_going) {
		LOG_WRN("Transaction ID %d already in use", params->transaction_id);
		k_mutex_unlock(&dect_mac_ctrl_data_mtx);
		return -EBUSY;
	}
	ctrl_data.dlc_data_tx_infos[arr_index].transaction_id = params->transaction_id;
	ctrl_data.dlc_data_tx_infos[arr_index].data_len = params->data_len;
	ctrl_data.dlc_data_tx_infos[arr_index].req_on_going = true;
#endif
	k_mutex_unlock(&dect_mac_ctrl_data_mtx);

	ret = nrf_modem_dect_dlc_data_tx(&tx_params);
	if (ret) {
		if (ret == -NRF_ENOMEM) {
			ret = -ENOMEM;
			LOG_WRN("nrf_modem_dect_dlc_data_tx returned NRF_ENOMEM");
		} else {
			LOG_ERR("nrf_modem_dect_dlc_data_tx returned error: %d", ret);
		}
#if defined(CONFIG_DECT_NRP_MAC_NRF_TX_FLOW_CTRL_BASED_ON_MDM_TX_DLC_REQS)
		ctrl_data.dlc_data_tx_infos[arr_index].req_on_going = false;
#endif
	} else {
#if defined(CONFIG_DECT_NRP_MAC_NRF_TX_FLOW_CTRL_BASED_ON_MDM_TX_DLC_REQS)
		k_mutex_lock(&dect_mac_ctrl_data_mtx, K_FOREVER);
		ctrl_data.total_unacked_tx_data_amount += params->data_len;
		ctrl_data.total_unacked_req_amount++;
		k_mutex_unlock(&dect_mac_ctrl_data_mtx);
#endif
	}

	return ret;
}

/**************************************************************************************************/

int dect_nrf91_ctrl_api_cluster_start_req_cmd(struct dect_cluster_start_req_params *params)
{
	struct dect_nrf91_settings *set_ptr = dect_nrf91_settings_ref_get();

	if (set_ptr->net_mgmt_common.device_type == DECT_DEVICE_TYPE_PT) {
		LOG_ERR("Cluster start not allowed for PT");
		return -EINVAL;
	}

	if (ctrl_data.ft_cluster_state != CTRL_FT_CLUSTER_STATE_NONE) {
		LOG_ERR("Cluster already started/starting");
		return -EALREADY;
	}
	/* Validate params */
	if (params->channel != DECT_CLUSTER_CHANNEL_ANY &&
	    dect_common_utils_channel_is_supported_by_band(
		set_ptr->net_mgmt_common.band_nbr, params->channel) == false) {
		LOG_ERR("Channel %d not supported by band %d", params->channel,
			set_ptr->net_mgmt_common.band_nbr);
		return -EINVAL;
	}
	return dect_nrf91_ctrl_msgq_data_op_add(
		DECT_NRF91_CTRL_OP_CLUSTER_START_REQ, params,
		sizeof(struct dect_cluster_start_req_params));
}

int dect_nrf91_ctrl_api_cluster_reconfig_req_cmd(struct dect_cluster_reconfig_req_params *params)
{
	/* Validate params */
	struct dect_nrf91_settings *set_ptr = dect_nrf91_settings_ref_get();

	if (params->channel != DECT_CLUSTER_CHANNEL_ANY &&
	    dect_common_utils_channel_is_supported_by_band(
		    set_ptr->net_mgmt_common.band_nbr, params->channel) == false) {
		LOG_ERR("Channel %d not supported by band %d", params->channel,
			set_ptr->net_mgmt_common.band_nbr);
		return -EINVAL;
	}
	if (ctrl_data.ft_cluster_state != CTRL_FT_CLUSTER_STATE_STARTED) {
		LOG_ERR("Cluster not started");
		return -EINVAL;
	}

	return dect_nrf91_ctrl_msgq_data_op_add(DECT_NRF91_CTRL_OP_CLUSTER_RECONFIG_REQ, params,
						sizeof(struct dect_cluster_reconfig_req_params));
}
int dect_nrf91_ctrl_api_cluster_reconfig_start_for_ipv6_prefix_cfg_changed(void)
{
	if (ctrl_data.ft_cluster_state != CTRL_FT_CLUSTER_STATE_STARTED) {
		LOG_DBG("Cluster not started");
		return -EINVAL;
	}
	return dect_nrf91_ctrl_msgq_non_data_op_add(
		DECT_NRF91_CTRL_OP_CLUSTER_IPV6_PREFIX_CHANGE_RECONFIG_REQ);
}

int dect_nrf91_ctrl_api_cluster_info_req_cmd(void)
{
	int err = nrf_modem_dect_mac_cluster_info();

	if (err) {
		LOG_ERR("%s: error intitiating the request for cluster info: %d", (__func__), err);
	}

