jhirsi/sdk-nrf/drivers/dect_nrp/nrf91_mac/dect_nrf91_ctrl.c
	return err;
}

/**************************************************************************************************/

static bool dect_nrf91_ctrl_nw_beacon_common_can_be_started(uint16_t channel)
{
	struct dect_nrf91_settings *set_ptr = dect_nrf91_settings_ref_get();

	if (set_ptr->net_mgmt_common.device_type == DECT_DEVICE_TYPE_PT) {
		LOG_ERR("Network beacon can not be started for PT");
		return false;
	}

	if (dect_common_utils_channel_is_supported_by_band(set_ptr->net_mgmt_common.band_nbr,
							   channel) == false) {
		LOG_ERR("Channel %d not supported by band %d", channel,
			set_ptr->net_mgmt_common.band_nbr);
		return false;
	}

	return true;
}

int dect_nrf91_ctrl_api_nw_beacon_start_req_cmd(struct dect_nw_beacon_start_req_params *params)
{
	struct dect_nrf91_settings *set_ptr = dect_nrf91_settings_ref_get();

	if (dect_nrf91_ctrl_nw_beacon_common_can_be_started(params->channel) == false) {
		return -EINVAL;
	}
	if (ctrl_data.ft_cluster_state != CTRL_FT_CLUSTER_STATE_STARTED) {
		LOG_ERR("Cluster not started");
		return false;
	}
	if (ctrl_data.ft_nw_beacon_state != CTRL_FT_NW_BEACON_STATE_NONE) {
		LOG_ERR("Network beacon already started/starting");
		return -EINVAL;
	}

	for (int i = 0; i < params->additional_ch_count; i++) {
		if (dect_common_utils_channel_is_supported_by_band(
			    set_ptr->net_mgmt_common.band_nbr, params->additional_ch_list[i]) ==
		    false) {
			LOG_ERR("Additional channel %d not supported by band %d",
				params->additional_ch_list[i], set_ptr->net_mgmt_common.band_nbr);
			return -EINVAL;
		}
	}

	return dect_nrf91_ctrl_msgq_data_op_add(DECT_NRF91_CTRL_OP_MDM_NW_BEACON_START, params,
						sizeof(struct dect_nw_beacon_start_req_params));
}

int dect_nrf91_ctrl_api_nw_beacon_stop_req_cmd(struct dect_nw_beacon_stop_req_params *params)
{
	if (ctrl_data.ft_nw_beacon_state == CTRL_FT_NW_BEACON_STATE_NONE ||
	    ctrl_data.ft_nw_beacon_state == CTRL_FT_NW_BEACON_STATE_STOPPING) {
		LOG_ERR("Network beacon already stopped or stopping");
		return -EALREADY;
	}
	return dect_nrf91_ctrl_msgq_non_data_op_add(DECT_NRF91_CTRL_OP_MDM_NW_BEACON_STOP);
}

/**************************************************************************************************/

int dect_nrf91_ctrl_api_network_create_req_cmd(void)
{
	if (ctrl_data.mdm_activation_state != CTRL_MDM_ACTIVATED) {
		LOG_ERR("%s: modem not activated, cannot create network", (__func__));
		return -EINVAL;
	}
	if (ctrl_data.ft_cluster_state != CTRL_FT_CLUSTER_STATE_NONE) {
		LOG_WRN("%s: cluster already started/starting", (__func__));
		return -EALREADY;
	}
	if (ctrl_data.configure_params.auto_start) {
		LOG_ERR("%s: auto start already enabled", (__func__));
		return -EALREADY;
	}
	if (ctrl_data.ft_network_state != CTRL_FT_NETWORK_STATE_NONE) {
		LOG_WRN("%s: network already started/starting", (__func__));
		return -EALREADY;
	}
	struct dect_nrf91_settings *set_ptr = dect_nrf91_settings_ref_get();
	uint16_t nw_beacon_channel = set_ptr->net_mgmt_common.nw_beacon.channel;

	if (nw_beacon_channel != DECT_MAC_NW_BEACON_CHANNEL_NOT_USED &&
	    dect_nrf91_ctrl_nw_beacon_common_can_be_started(
		    set_ptr->net_mgmt_common.nw_beacon.channel) == false) {
		LOG_ERR("%s: change settings - invalid channel %d for network beacon in band %d",
			(__func__),
			nw_beacon_channel, set_ptr->net_mgmt_common.band_nbr);
		return -EINVAL;
	}
	ctrl_data.ft_network_state = CTRL_FT_NETWORK_STATE_STARTING;

	return dect_nrf91_ctrl_msgq_non_data_op_add(DECT_NRF91_CTRL_OP_AUTO_START);
}

bool dect_nrf91_ctrl_api_network_remove_req_cmd_allowed(void)
{
	if (ctrl_data.ft_network_state == CTRL_FT_NETWORK_STATE_NONE &&
	    ctrl_data.ft_cluster_state == CTRL_FT_CLUSTER_STATE_NONE) {
		return false;
	}
	return true;
}

int dect_nrf91_ctrl_api_network_remove_req_cmd(void)
{
	int ret = dect_nrf91_ctrl_mdm_deactivate_req();

	if (ret != 0) {
		LOG_ERR("%s: error in deactivate, error: %d", (__func__), ret);
	} else {
		ctrl_data.mdm_activation_state = CTRL_MDM_REACTIVATING_DEACTIVATE;
	}
	return ret;
}

/**************************************************************************************************/

int dect_nrf91_ctrl_api_network_join_req_cmd(void)
{
	if (ctrl_data.mdm_activation_state != CTRL_MDM_ACTIVATED) {
		LOG_ERR("%s: Modem not activated, cannot join network", (__func__));
		return -EINVAL;
	}
	if (ctrl_data.ass_config.pt_association_state == CTRL_PT_ASSOCIATION_STATE_ASSOCIATED) {
		LOG_ERR("%s: Already associated", (__func__));
		return -EALREADY;
	}
	if (ctrl_data.configure_params.auto_start) {
		LOG_ERR("%s: Auto start already enabled", (__func__));
		return -EALREADY;
	}

	return dect_nrf91_ctrl_msgq_non_data_op_add(DECT_NRF91_CTRL_OP_AUTO_START);
}

int dect_nrf91_ctrl_api_network_unjoin_req_cmd(void)
{
	if (ctrl_data.ass_config.pt_association_state != CTRL_PT_ASSOCIATION_STATE_ASSOCIATED) {
		LOG_ERR("Not joined");
		return -EALREADY;
	}
	int err = dect_nrf91_ctrl_api_associate_release_cmd(
		ctrl_data.ass_config.parent_long_rd_id,
		NRF_MODEM_DECT_MAC_RELEASE_CAUSE_CONNECTION_TERMINATION);

	if (err) {
		LOG_ERR("dect_nrf91_ctrl_api_associate_release_cmd returned err: %d", err);
	}
	return err;
}

/**************************************************************************************************/

int dect_nrf91_ctrl_api_neighbor_list_req_cmd(void)
{
	int err = nrf_modem_dect_mac_neighbor_list();

	if (err) {
		LOG_ERR("Error intitiating the request for neighbor list: %d", err);
	}

	return err;
}

/**************************************************************************************************/

int dect_nrf91_ctrl_api_neighbor_info_req_cmd(
	struct nrf_modem_dect_mac_neighbor_info_params *params)
{
	int err = nrf_modem_dect_mac_neighbor_info(params);

	if (err) {
		LOG_ERR("%s: error intitiating the request for neighbor info: %d", (__func__), err);
	}

	return err;
}

/**************************************************************************************************/

int dect_nrf91_ctrl_api_associate_req_cmd(struct nrf_modem_dect_mac_association_params *params)
{
	int err = nrf_modem_dect_mac_association(params);

	if (err) {
		LOG_ERR("%s: initiation association failed, err: %d", (__func__), err);
	}

