jhirsi/sdk-nrf/drivers/dect_nrp/nrf91_mac/dect_nrf91_ctrl.c
	return err;
}

int dect_nrf91_ctrl_api_associate_release_cmd(
	uint32_t long_rd_id, enum nrf_modem_dect_mac_release_cause rel_cause)
{
	struct nrf_modem_dect_mac_association_release_params params = {
		.release_cause = rel_cause,
		.long_rd_id = long_rd_id,
	};
	int err = nrf_modem_dect_mac_association_release(&params);

	if (err) {
		LOG_ERR("%s: initiation association release failed, err: %d", (__func__), err);
	}
	ctrl_data.last_rel_cause = rel_cause;

	return err;
}
static void dect_mac_ctrl_trigger_association(void)
{
	LOG_INF("Association triggered towards:");
	LOG_INF("  network id (32bit).............................%u (0x%08x)",
		ctrl_data.ass_config.network_id, ctrl_data.ass_config.network_id);
	LOG_INF("  transmitter id (long RD ID)....................%u (0x%08x)",
		ctrl_data.ass_config.parent_long_rd_id, ctrl_data.ass_config.parent_long_rd_id);

	struct nrf_modem_dect_mac_tx_flow_config flow_config[3] = {
		{
			.flow_id = 1,
			.dlc_service_type = NRF_MODEM_DECT_DLC_SERVICE_TYPE_3,
			.dlc_sdu_lifetime = NRF_MODEM_DECT_DLC_SDU_LIFETIME_60_S,
		},
		{ /* TODO: onko turhia? */
			.flow_id = 2,
			.dlc_service_type = NRF_MODEM_DECT_DLC_SERVICE_TYPE_3,
			.dlc_sdu_lifetime = 255,
		},
		{
			.flow_id = 3,
			.priority = 3,
			.dlc_service_type = NRF_MODEM_DECT_DLC_SERVICE_TYPE_3,
			.dlc_sdu_lifetime = 255,
		},
	};
	struct dect_nrf91_settings *set_ptr = dect_nrf91_settings_ref_get();
	struct nrf_modem_dect_mac_association_params params = {
		.long_rd_id = ctrl_data.ass_config.parent_long_rd_id,
		.network_id = ctrl_data.ass_config.network_id,
		.num_flows = 3,
		.tx_flow_configs = flow_config,
		.info_triggers.num_beacon_rx_failures =
			set_ptr->net_mgmt_common.association.max_beacon_rx_failures,
	};
	int err = nrf_modem_dect_mac_association(&params);

	if (err) {
		LOG_ERR("nrf_modem_dect_mac_association failed: err %d", err);
	}
}

/**************************************************************************************************/

static void dect_nrf91_ctrl_msgq_thread_handler(void)
{
	struct dect_mac_common_op_event_msgq_item event;
	int err;
	char tmp_str[128] = {0};

	while (true) {
		k_msgq_get(&dect_nrf91_ctrl_msgq, &event, K_FOREVER);

		switch (event.id) {

		case DECT_NRF91_CTRL_OP_MDM_CAPABILITIES: {
			struct nrf_modem_dect_mac_capability_ntf_cb_params *evt_data =
				(struct nrf_modem_dect_mac_capability_ntf_cb_params *)event.data;

			LOG_INF("Modem Capabilities:");
			LOG_INF("  max_mcs: %hhu", evt_data->max_mcs);
			for (int i = 0; i < evt_data->num_band_info_elems; i++) {
				LOG_INF("    band[%hhu]:                   %hhu", i,
					evt_data->band_info_elems[i].band);
				LOG_DBG("    band_group_index[%hhu]:       %hhu", i,
					evt_data->band_info_elems[i].band_group_index);
				LOG_INF("    power_class[%hhu]:            %hhu", i,
					evt_data->band_info_elems[i].power_class);
				LOG_INF("    min_carrier[%hhu]:            %hu", i,
					evt_data->band_info_elems[i].min_carrier);
				LOG_INF("    max_carrier[%hhu]:            %hu", i,
					evt_data->band_info_elems[i].max_carrier);
			}
			/* Store capabilities */
			ctrl_data.mdm_capas = *evt_data;
			break;
		}
		case DECT_NRF91_CTRL_OP_MDM_CONFIGURE_RESP: {
			enum nrf_modem_dect_mac_err *status =
				(enum nrf_modem_dect_mac_err *)event.data;

			if (*status != NRF_MODEM_DECT_MAC_STATUS_OK) {
				dect_nrf91_utils_modem_mac_err_to_string(*status, tmp_str);

				LOG_ERR("Error in configure: err %s (%d)", tmp_str, *status);
				break;
			}
			k_sem_give(&dect_mac_libmodem_api_sema);

			if (ctrl_data.configure_params.auto_activate ||
			    ctrl_data.mdm_activation_state == CTRL_MDM_ACTIVATE_REQ ||
			    ctrl_data.mdm_activation_state == CTRL_MDM_REACTIVATING_CONFIGURE) {
				LOG_DBG("Modem configured: "
					"activating to full functional mode");

				if (dect_nrf91_ctrl_mdm_activate_req()) {
					ctrl_data.mdm_activation_state = CTRL_MDM_DEACTIVATED;
					LOG_ERR("Error in initiating modem activation");
				}
			} else {
				LOG_INF("Modem configured without auto start - deactivated");
				ctrl_data.mdm_activation_state = CTRL_MDM_DEACTIVATED;
			}
			break;
		}
		case DECT_NRF91_CTRL_OP_MDM_CFUN_RESP: {
			enum nrf_modem_dect_mac_err *status =
				(enum nrf_modem_dect_mac_err *)event.data;

			if (*status != NRF_MODEM_DECT_MAC_STATUS_OK) {
				/* Operation wasn't successful -> no change to activation state */
				dect_nrf91_utils_modem_mac_err_to_string(*status, tmp_str);
				if (ctrl_data.mdm_activation_state == CTRL_MDM_ACTIVATE_REQ) {
					dect_mgmt_activate_done_evt(
						ctrl_data.iface,
						dect_nrf91_utils_modem_status_to_net_mgmt_status(
							*status));

				} else {
					__ASSERT_NO_MSG(ctrl_data.mdm_activation_state ==
								CTRL_MDM_DEACTIVATE_REQ ||
							ctrl_data.mdm_activation_state ==
								CTRL_MDM_DEACTIVATED);
					dect_mgmt_deactivate_done_evt(
						ctrl_data.iface,
						dect_nrf91_utils_modem_status_to_net_mgmt_status(
							*status));
				}
				LOG_ERR("Error in activate/CFUN req: err %s (%d)", tmp_str,
					*status);
				break;
			}

			if ((ctrl_data.configure_params.auto_activate &&
			     (ctrl_data.mdm_activation_state != CTRL_MDM_DEACTIVATE_REQ &&
			      ctrl_data.mdm_activation_state !=
				      CTRL_MDM_REACTIVATING_DEACTIVATE)) ||
			    ctrl_data.mdm_activation_state == CTRL_MDM_ACTIVATE_REQ ||
			    ctrl_data.mdm_activation_state == CTRL_MDM_REACTIVATING_CONFIGURE) {
				dect_nrf91_ctrl_msgq_non_data_op_add(
					DECT_NRF91_CTRL_OP_MDM_ACTIVATED);
			} else {
				__ASSERT_NO_MSG(
					ctrl_data.mdm_activation_state == CTRL_MDM_DEACTIVATE_REQ ||
					ctrl_data.mdm_activation_state == CTRL_MDM_DEACTIVATED ||
					ctrl_data.mdm_activation_state ==
						CTRL_MDM_REACTIVATING_DEACTIVATE);
				dect_nrf91_ctrl_msgq_non_data_op_add(
					DECT_NRF91_CTRL_OP_MDM_DEACTIVATED);
			}
			break;
		}
		case DECT_NRF91_CTRL_OP_MDM_ACTIVATED: {
			if (ctrl_data.mdm_activation_state != CTRL_MDM_REACTIVATING_CONFIGURE) {
				net_if_carrier_on(ctrl_data.iface);
				dect_mgmt_activate_done_evt(ctrl_data.iface, DECT_MAC_STATUS_OK);
			}
			ctrl_data.mdm_activation_state = CTRL_MDM_ACTIVATED;
			ctrl_data.tx_mdm_flow_ctrl_on = false;
#if defined(CONFIG_DECT_NRP_MAC_NRF_TX_FLOW_CTRL_BASED_ON_MDM_TX_DLC_REQS)
			ctrl_data.total_unacked_tx_data_amount = 0;
			memset(ctrl_data.dlc_data_tx_infos, 0, sizeof(ctrl_data.dlc_data_tx_infos));
#endif
			k_sem_give(&dect_mac_ctrl_reactivate_sema);
			LOG_INF("Modem activated - ready for commands");
			break;
		}

