jhirsi/sdk-nrf/drivers/dect_nrp/nrf91_mac/dect_nrf91_ctrl.c
		case DECT_NRF91_CTRL_OP_MDM_DEACTIVATED: {
			bool reactivate =
				(ctrl_data.mdm_activation_state == CTRL_MDM_REACTIVATING_DEACTIVATE)
					? true
					: false;

			ctrl_data.ft_nw_beacon_state = CTRL_FT_NW_BEACON_STATE_NONE;
			ctrl_data.configure_params.channel = 0;
			if (ctrl_data.ft_network_state != CTRL_FT_NETWORK_STATE_NONE ||
			    ctrl_data.ft_cluster_state != CTRL_FT_CLUSTER_STATE_NONE) {
				struct dect_network_status_evt network_status_data = {
					.network_status = DECT_NETWORK_STATUS_REMOVED,
				};

				if (ctrl_data.mdm_activation_state != CTRL_MDM_DEACTIVATE_REQ) {
					/* If not deactivated by user, then we need to
					 * reactivate the modem to be able to remove network,
					 */
					reactivate = true;
				}
				dect_nrf91_child_association_all_removed();
				dect_mgmt_network_status_evt(ctrl_data.iface, network_status_data);
			}
			ctrl_data.mdm_activation_state = CTRL_MDM_DEACTIVATED;
			ctrl_data.ft_cluster_state = CTRL_FT_CLUSTER_STATE_NONE;
			ctrl_data.ft_network_state = CTRL_FT_NETWORK_STATE_NONE;
			ctrl_data.ft_requested_cluster_channel = DECT_CLUSTER_CHANNEL_ANY;
			ctrl_data.ft_cluster_reconfig_params.channel = DECT_CLUSTER_CHANNEL_ANY;
			ctrl_data.ft_cluster_reconfig_ongoing = false;
			ctrl_data.configure_params.auto_start = false;

			if (reactivate) {
				LOG_DBG("Deactivated. Next configure before reactivate");
				/* Reactivate modem to be able to give commands still */
				if (dect_nrf91_ctrl_api_mdm_configure_n_activate()) {
					LOG_ERR("Error in initiating modem configure and activate");
				} else {
					ctrl_data.mdm_activation_state =
						CTRL_MDM_REACTIVATING_CONFIGURE;
					/* we do not want to send dectivate evt when reactivating */
					break;
				}
			}
			LOG_INF("Modem state: deactivated");
			net_if_carrier_off(ctrl_data.iface);
			dect_mgmt_deactivate_done_evt(ctrl_data.iface, DECT_MAC_STATUS_OK);

			break;
		}
		case DECT_NRF91_CTRL_OP_CLUSTER_RECONFIG_REQ: {
			struct dect_cluster_reconfig_req_params *params =
				(struct dect_cluster_reconfig_req_params *)event.data;

			ctrl_data.ft_cluster_state = CTRL_FT_CLUSTER_STATE_STARTING;

			ctrl_data.ft_requested_cluster_channel = params->channel;
			ctrl_data.ft_cluster_reconfig_params = *params;

			ctrl_data.ft_cluster_reconfig_ongoing = true;

			/* Store current channel in case of cluster_reconfig failure */
			ctrl_data.ft_cluster_reconfig_prev_cluster_channel =
				ctrl_data.configure_params.channel;

			ctrl_data.configure_params.channel = 0;

			dect_nrf91_ctrl_msgq_non_data_op_add(
				DECT_NRF91_CTRL_OP_AUTO_START);
			break;
		}
		case DECT_NRF91_CTRL_OP_CLUSTER_IPV6_PREFIX_CHANGE_RECONFIG_REQ: {
			ctrl_data.ft_cluster_state = CTRL_FT_CLUSTER_STATE_STARTING;

			/* Keep current channel, just reconfig ipv6 cfg  */
			ctrl_data.ft_requested_cluster_channel =
				ctrl_data.configure_params.channel;
			ctrl_data.ft_cluster_reconfig_prev_cluster_channel =
				ctrl_data.configure_params.channel;

			ctrl_data.ft_cluster_reconfig_ongoing = true;

			dect_nrf91_ctrl_msgq_non_data_op_add(
				DECT_NRF91_CTRL_OP_AUTO_START);
			break;
		}
		case DECT_NRF91_CTRL_OP_CLUSTER_START_REQ: {
			struct dect_cluster_start_req_params *params =
				(struct dect_cluster_start_req_params *)event.data;

			ctrl_data.ft_cluster_state = CTRL_FT_CLUSTER_STATE_STARTING;
			ctrl_data.ft_requested_cluster_channel = params->channel;

			dect_nrf91_ctrl_msgq_non_data_op_add(
				DECT_NRF91_CTRL_OP_AUTO_START);
			break;
		}
		case DECT_NRF91_CTRL_OP_CLUSTER_CONFIG_RESP: {
			struct nrf_modem_dect_mac_cluster_configure_cb_params *params = event.data;
			struct dect_nrf91_settings *set_ptr = dect_nrf91_settings_ref_get();
			struct dect_cluster_start_resp_evt resp_evt = {
				.status = params->status,
				.cluster_channel = 0,
			};
			struct dect_network_status_evt network_status_data;

			ctrl_data.ft_requested_cluster_channel = DECT_CLUSTER_CHANNEL_ANY;

			if (params->status != NRF_MODEM_DECT_MAC_STATUS_OK) {
				if (ctrl_data.ft_cluster_reconfig_ongoing &&
				    ctrl_data.ft_cluster_state == CTRL_FT_CLUSTER_STATE_STARTING) {
					/* Reconfig failure, existing cluster config
					 * still running
					 */
					ctrl_data.ft_cluster_state = CTRL_FT_CLUSTER_STATE_STARTED;
					ctrl_data.ft_cluster_reconfig_ongoing = false;
					ctrl_data.ft_requested_cluster_channel =
						DECT_CLUSTER_CHANNEL_ANY;
					ctrl_data.configure_params.channel =
						ctrl_data.ft_cluster_reconfig_prev_cluster_channel;
					break;
				}

				network_status_data.network_status = DECT_NETWORK_STATUS_FAILURE;
				network_status_data.dect_err_cause =
					dect_nrf91_utils_modem_status_to_net_mgmt_status(
						params->status);

				dect_nrf91_utils_modem_mac_err_to_string(params->status, tmp_str);
				LOG_ERR("Error in Cluster config: err %s (%d)", tmp_str,
					params->status);

				ctrl_data.ft_cluster_state = CTRL_FT_CLUSTER_STATE_NONE;
				ctrl_data.ft_network_state = CTRL_FT_NETWORK_STATE_NONE;
				dect_mgmt_network_status_evt(ctrl_data.iface, network_status_data);
				goto send_events;
			}
			LOG_INF("Cluster configured");

			__ASSERT_NO_MSG(set_ptr->net_mgmt_common.device_type ==
					DECT_DEVICE_TYPE_FT);

			ctrl_data.ft_cluster_state = CTRL_FT_CLUSTER_STATE_STARTED;
			resp_evt.cluster_channel = ctrl_data.configure_params.channel;
			ctrl_data.ft_cluster_reconfig_ongoing = false;
send_events:
			dect_mgmt_cluster_created_evt(ctrl_data.iface, resp_evt);
			ctrl_data.configure_params.auto_start =
				false; /* TODO: is this right if creating nw and going to start
					* network beacon also?
					*/
			if (ctrl_data.ft_network_state == CTRL_FT_NETWORK_STATE_STARTING) {
				if (set_ptr->net_mgmt_common.nw_beacon.channel !=
				    DECT_MAC_NW_BEACON_CHANNEL_NOT_USED) {
					/* Network beacon start if configured */
					struct dect_nrf91_settings *set_ptr =
						dect_nrf91_settings_ref_get();
					struct dect_nw_beacon_start_req_params params = {
						.channel =
							set_ptr->net_mgmt_common.nw_beacon.channel,
						.additional_ch_count =
							0, /* TODO: settings support to be added? */
					};

