jhirsi/sdk-nrf/drivers/dect_nrp/nrf91_mac/dect_nrf91_ctrl.c
					dect_nrf91_ctrl_msgq_data_op_add(
						DECT_NRF91_CTRL_OP_MDM_NW_BEACON_START, &params,
						sizeof(struct dect_nw_beacon_start_req_params));
				} else {
					LOG_INF("Network created - network beacon not configured");
					ctrl_data.ft_network_state = CTRL_FT_NETWORK_STATE_CREATED;
					network_status_data.network_status =
						DECT_NETWORK_STATUS_CREATED;
					dect_mgmt_network_status_evt(ctrl_data.iface,
								     network_status_data);
				}
			}
			break;
		}
		case DECT_NRF91_CTRL_OP_CLUSTER_CH_LOAD_CHANGED: {
			struct nrf_modem_dect_mac_cluster_ch_load_change_ntf_cb_params *evt_data =
				(struct nrf_modem_dect_mac_cluster_ch_load_change_ntf_cb_params *)
					event.data;
			struct dect_nrf91_settings *set_ptr = dect_nrf91_settings_ref_get();
			struct nrf_modem_dect_mac_rssi_result *mdm_rssi_res =
				&evt_data->rssi_result;
			struct dect_rssi_scan_result_data rssi_data;

			LOG_INF("Cluster channel load changed: channel %u, busy_percentage %d",
				evt_data->rssi_result.channel,
				evt_data->rssi_result.busy_percentage);

			/* TODO: trigger a new channel selection procedure RSSI scan for
			 * neighbor channels
			 */
			if (set_ptr->net_mgmt_common.cluster.channel_loaded_percent == 0) {
				/* Channel reselection/reconfigure disabled, no worth to continue */
				break;
			}
			if (ctrl_data.ft_cluster_state != CTRL_FT_CLUSTER_STATE_STARTED) {
				/* Cluster not started - cannot reconfigure */
				break;
			}
			int err = dect_nrf91_utils_mdm_rssi_results_to_l2_rssi_data(mdm_rssi_res,
										    &rssi_data);

			if (err) {
				LOG_ERR("Error in converting RSSI results to L2 data: %d", err);
				break;
			}
			uint8_t channel_loaded_percent = 100 - rssi_data.scan_suitable_percent;

			if (channel_loaded_percent > set_ptr->net_mgmt_common
				.cluster.channel_loaded_percent) {
				LOG_WRN("Cluster channel load (%u%%) exceeded threshold (%d%%): "
					"channel %u",
					channel_loaded_percent,
					set_ptr->net_mgmt_common
						.cluster.channel_loaded_percent,
					evt_data->rssi_result.channel);
				if (set_ptr->net_mgmt_common.device_type == DECT_DEVICE_TYPE_FT) {
					struct dect_nrf91_settings *set_ptr =
						dect_nrf91_settings_ref_get();
					struct dect_cluster_reconfig_req_params params = {
						.channel = DECT_CLUSTER_CHANNEL_ANY,
						.max_beacon_tx_power_dbm =
							set_ptr->net_mgmt_common.cluster
								.max_beacon_tx_power_dbm,
						.max_cluster_power_dbm = set_ptr->net_mgmt_common
							.cluster.max_cluster_power_dbm,
						.period = set_ptr->net_mgmt_common
							.cluster.beacon_period,
					};

					LOG_INF("FT: starting channel reselection procedure");

					/* Trigger a channel reselection procedure */
					dect_nrf91_ctrl_msgq_data_op_add(
						DECT_NRF91_CTRL_OP_CLUSTER_RECONFIG_REQ, &params,
						sizeof(struct dect_cluster_reconfig_req_params));
				}
			}
			break;
		}
		case DECT_NRF91_CTRL_OP_NEIGHBOR_INACTIVITY: {
			struct nrf_modem_dect_mac_neighbor_inactivity_ntf_cb_params *evt_data =
				(struct nrf_modem_dect_mac_neighbor_inactivity_ntf_cb_params *)
					event.data;
			struct dect_nrf91_settings *set_ptr = dect_nrf91_settings_ref_get();

			LOG_INF("Neighbor inactivity: long_rd_id %u (0x%X)", evt_data->long_rd_id,
				evt_data->long_rd_id);

			/* If inactivity timer is supported and child has been too long as inactive
			 * -> drop it
			 */
			if (set_ptr->net_mgmt_common.device_type == DECT_DEVICE_TYPE_FT &&
			    set_ptr->net_mgmt_common.cluster
				.neighbor_inactivity_disconnect_timer_ms) {
				LOG_WRN("Neighbor inactive for too long - "
					"releasing association: long_rd_id %u (0x%X)",
					evt_data->long_rd_id, evt_data->long_rd_id);

				/* Release association for this child neighbor */
				dect_nrf91_ctrl_api_associate_release_cmd(
					evt_data->long_rd_id,
					NRF_MODEM_DECT_MAC_RELEASE_CAUSE_LONG_INACTIVITY);
			}
			break;
		}
		case DECT_NRF91_CTRL_OP_AUTO_START: {
			struct dect_nrf91_settings *set_ptr = dect_nrf91_settings_ref_get();

			ctrl_data.configure_params.auto_start = true;

			/* Clear seen cluster channels */
			memset(ctrl_data.scan_data.cluster_channels, 0,
			sizeof(ctrl_data.scan_data.cluster_channels));
			ctrl_data.scan_data.current_cluster_channel_index = 0;

			if (set_ptr->net_mgmt_common.device_type == DECT_DEVICE_TYPE_FT) {
				struct nrf_modem_dect_mac_network_scan_params params = {
					.network_id_filter_mode =
						NRF_MODEM_DECT_MAC_NW_ID_FILTER_MODE_NONE,
					.band = set_ptr->net_mgmt_common.band_nbr,
					.scan_time = 2100, /* TODO: a config setting for this one?*/
					.num_channels = 0,
				};

				if (ctrl_data.ft_requested_cluster_channel !=
				    DECT_CLUSTER_CHANNEL_ANY) {
					params.num_channels = 1;
					params.channel_list[0] =
						ctrl_data.ft_requested_cluster_channel;
				} else {
					uint8_t num_channels =
						NRF_MODEM_DECT_MAC_MAX_CHANNELS_IN_NETWORK_SCAN_REQ;
					uint16_t channel_list
					[NRF_MODEM_DECT_MAC_MAX_CHANNELS_IN_NETWORK_SCAN_REQ];

					if (dect_common_utils_use_harmonized_std(
						    set_ptr->net_mgmt_common.band_nbr) &&
					    dect_common_utils_harmonized_band_channel_array_get(
						    set_ptr->net_mgmt_common.band_nbr, channel_list,
						    &num_channels)) {
						/* Per harmonized std: only odd number channels at
						 * band #1:
						 * ETSI EN 301 406-2, V3.0.1, ch 4.3.2.3.
						 */
						params.num_channels = num_channels;
						memcpy(params.channel_list, channel_list,
						       num_channels * sizeof(uint16_t));
					}
				}

				if (ctrl_data.ft_cluster_reconfig_ongoing) {
					/* Do not initiate nw scan if cluster is already running and
					 * doing reconfig
					 */
					err = -EALREADY;
				} else {
					LOG_INF("FT device auto start for cluster start: "
						"starting NW scanning to see where other "
						"clusters are: band %hhu, num_channels %hhu",
						params.band, params.num_channels);
					err = nrf_modem_dect_mac_network_scan(&params);
				}
				if (!err) {
					ctrl_data.scan_data.on_going = true;
					ctrl_data.scan_data.scan_result_cb = NULL;
					ctrl_data.scan_data.scan_params = params;
				} else {
					/* As a default RSSI params from settings  */
					struct nrf_modem_dect_mac_rssi_scan_params params = {
						.channel_scan_length =
							set_ptr->net_mgmt_common.rssi_scan
								.time_per_channel_ms /
							10,
						.threshold_min = set_ptr->net_mgmt_common.rssi_scan
									 .free_threshold_dbm,
						.threshold_max = set_ptr->net_mgmt_common.rssi_scan
									 .busy_threshold_dbm,
						.num_channels = 0,
						.band = set_ptr->net_mgmt_common.band_nbr,
					};

					__ASSERT_NO_MSG(set_ptr->net_mgmt_common.device_type ==
							DECT_DEVICE_TYPE_FT);
					if (ctrl_data.ft_requested_cluster_channel !=
					    DECT_CLUSTER_CHANNEL_ANY) {
						params.num_channels = 1;
						params.channel_list[0] =
							ctrl_data.ft_requested_cluster_channel;
					}
					if (ctrl_data.ft_cluster_reconfig_ongoing) {
						/* Only one frame RSSI measurement if reconfiguring
						 */
						params.channel_scan_length = 1;
					} else {
						LOG_WRN("Error initiating NW scan: err %d -"
							"starting directly RSSI scan",
							err);
					}

