jhirsi/sdk-nrf/drivers/dect_nrp/nrf91_mac/dect_nrf91_ctrl.c
					dect_nrf91_ctrl_msgq_data_op_add(
						DECT_NRF91_CTRL_OP_RSSI_START_REQ_CH_SELECTION,
						&params,
						sizeof(struct nrf_modem_dect_mac_rssi_scan_params));
				}
			} else {
				LOG_INF("PT device auto start: starting network scan");

				struct nrf_modem_dect_mac_network_scan_params params = {
					.network_id_filter_mode =
						NRF_MODEM_DECT_MAC_NW_ID_FILTER_MODE_32BIT,
					.network_id_filter =
						set_ptr->net_mgmt_common.identities.network_id,
					.scan_time = 2200,
					.num_channels = 0,
					.band = set_ptr->net_mgmt_common.band_nbr,
				};

				err = nrf_modem_dect_mac_network_scan(&params);
				if (err) {
					dect_nrf91_utils_modem_mac_err_to_string(err, tmp_str);
					LOG_ERR("Error in Network scan: err %s (%d)", tmp_str, err);
					ctrl_data.configure_params.auto_start = false;
					dect_mgmt_network_status_evt(
						ctrl_data.iface,
						(struct dect_network_status_evt){
							.network_status =
								DECT_NETWORK_STATUS_FAILURE,
							.dect_err_cause = DECT_MAC_STATUS_OS_ERROR,
							.os_err_cause = err,
						});
				} else {
					ctrl_data.scan_data.on_going = true;
					ctrl_data.scan_data.scan_result_cb = NULL;
					ctrl_data.scan_data.scan_params = params;
				}
			}
			break;
		}
		case DECT_NRF91_CTRL_OP_RSSI_START_REQ_CMD: {
			struct nrf_modem_dect_mac_rssi_scan_params *params =
				(struct nrf_modem_dect_mac_rssi_scan_params *)event.data;
			int err;

			LOG_INF("DECT_NRF91_CTRL_OP_RSSI_START_REQ_CMD: "
				"channel_scan_length %hu, num_channels %hu, band %hhu, "
				"min_threshold %hhd, max_threshold %hhd",
				params->channel_scan_length, params->num_channels, params->band,
				params->threshold_min, params->threshold_max);

			/* Log channels */
			for (uint32_t i = 0; i < params->num_channels; i++) {
				LOG_INF("  channel[%hhu]: %d", i, params->channel_list[i]);
			}
			err = nrf_modem_dect_mac_rssi_scan(params);
			if (err) {
				dect_nrf91_utils_modem_mac_err_to_string(err, tmp_str);
				LOG_ERR("Error initiating RSSI scan by params: err %s (%d)",
					tmp_str, err);
				dect_mgmt_rssi_scan_done_evt(
					ctrl_data.iface,
					dect_nrf91_utils_modem_status_to_net_mgmt_status(err));
				if (ctrl_data.ft_network_state != CTRL_FT_NETWORK_STATE_NONE) {
					ctrl_data.ft_network_state = CTRL_FT_NETWORK_STATE_NONE;
					dect_mgmt_network_status_evt(
						ctrl_data.iface,
						(struct dect_network_status_evt){
							.network_status =
								DECT_NETWORK_STATUS_FAILURE,
							.dect_err_cause = DECT_MAC_STATUS_OS_ERROR,
							.os_err_cause = err,
						});
				}
			} else {
				LOG_INF("RSSI scan started");
				dect_nrf91_ctrl_rssi_scan_data_init(true);

			}
			break;
		}

		case DECT_NRF91_CTRL_OP_RSSI_START_REQ_CH_SELECTION: {
			struct nrf_modem_dect_mac_rssi_scan_params *params =
				(struct nrf_modem_dect_mac_rssi_scan_params *)event.data;

			struct dect_nrf91_settings *set_ptr = dect_nrf91_settings_ref_get();

			LOG_INF("DECT_NRF91_CTRL_OP_RSSI_START_REQ_CH_SELECTION: "
				"channel_scan_length %hu, num_channels %hu, band %hhu, "
				"min_threshold %hhd, max_threshold %hhd",
				params->channel_scan_length, params->num_channels, params->band,
				params->threshold_min, params->threshold_max);

			if (params->num_channels == 0 &&
			    dect_common_utils_use_harmonized_std(
				set_ptr->net_mgmt_common.band_nbr) == true) {
				/* Per harmonized std: only odd number channels at band #1:
				 * ETSI EN 301 406-2, V3.0.1, ch 4.3.2.3.
				 */
				bool array_filled = false;

				params->num_channels = DECT_MAC_MAX_CHANNELS_IN_RSSI_SCAN;
				array_filled = dect_common_utils_harmonized_band_channel_array_get(
					set_ptr->net_mgmt_common.band_nbr, params->channel_list,
					&params->num_channels);
				if (!array_filled) {
					LOG_ERR("RSSI scanning start: "
						"error in channel array filling");
					break;
				}
			}
			err = nrf_modem_dect_mac_rssi_scan(params);
			if (err) {
				dect_nrf91_utils_modem_mac_err_to_string(err, tmp_str);
				LOG_ERR("Enrf_modem_dect_mac_rssi_scan failed: %s (%d)", tmp_str,
					err);
				if (ctrl_data.ft_cluster_reconfig_ongoing &&
				    ctrl_data.ft_cluster_state == CTRL_FT_CLUSTER_STATE_STARTING) {
					/* Reconfig failure, existing cluster config
					 * still running
					 */
					ctrl_data.ft_cluster_state = CTRL_FT_CLUSTER_STATE_STARTED;
					ctrl_data.configure_params.channel =
						ctrl_data.ft_cluster_reconfig_prev_cluster_channel;
					/* TODO send failure event?*/
				} else {
					ctrl_data.ft_cluster_state = CTRL_FT_CLUSTER_STATE_NONE;
				}
				ctrl_data.ft_requested_cluster_channel = DECT_CLUSTER_CHANNEL_ANY;
				ctrl_data.ft_cluster_reconfig_ongoing = false;
				dect_mgmt_rssi_scan_done_evt(ctrl_data.iface,
							     DECT_MAC_STATUS_OS_ERROR);
			} else {
				dect_nrf91_ctrl_rssi_scan_data_init(false);
				LOG_INF("RSSI scan started with params: "
					"channel_scan_length %hu, num_channels %hu, band %hhu, "
					"min_threshold %hhd, max_threshold %hhd",
					params->channel_scan_length, params->num_channels,
					params->band, params->threshold_min, params->threshold_max);
			}
			break;
		}

		case DECT_NRF91_CTRL_OP_MDM_RSSI_RESULT: {
			struct dect_nrf91_ctrl_rssi_measurement_data_evt *evt_data =
				(struct dect_nrf91_ctrl_rssi_measurement_data_evt *)event.data;
			struct nrf_modem_dect_mac_rssi_result *mdm_rssi_res =
				&evt_data->rssi_result;
			bool channel_has_another_cluster = false;

			LOG_DBG("RSSI scan results received");

			bool scan_suitable_percent_ok = false;
			bool all_subslots_free = false;
			struct dect_nrf91_settings *set_ptr = dect_nrf91_settings_ref_get();
			struct dect_rssi_scan_result_evt l2_results_evt;
			struct dect_rssi_scan_result_data *rssi_data =
				&l2_results_evt.rssi_scan_result;
			int err = dect_nrf91_utils_mdm_rssi_results_to_l2_rssi_data(mdm_rssi_res,
										    rssi_data);

			if (err) {
				LOG_ERR("Error in converting RSSI results to L2 data: %d", err);
			}

			/* Check if we have seen another cluster in this channel */
			if (dect_nrf91_ctrl_cluster_channels_list_channel_exists(
				rssi_data->channel)) {
				LOG_DBG("RSSI results: another cluster seen in this"
					" channel %d was seen in nw scanning phase",
					rssi_data->channel);
				channel_has_another_cluster = true;
				rssi_data->another_cluster_detected_in_channel = true;
			}
			all_subslots_free = rssi_data->all_subslots_free;
			if (rssi_data->scan_suitable_percent >=
				    set_ptr->net_mgmt_common.rssi_scan.scan_suitable_percent) {
				scan_suitable_percent_ok = true;
			}

