jhirsi/sdk-nrf/drivers/dect_nrp/nrf91_mac/dect_nrf91_ctrl.c
			LOG_INF("RSSI scan results: channel %d, all_subslots_free: %s, "
				"scan_suitable_percent: %d%%, "
				"busy_percentage: %d%%, "
				"another_cluster_detected_in_channel: %s",
				rssi_data->channel,
				(rssi_data->all_subslots_free) ? "yes" : "no",
				rssi_data->scan_suitable_percent,
				rssi_data->busy_percentage,
				(rssi_data->another_cluster_detected_in_channel) ? "yes" : "no");

			dect_mgmt_rssi_scan_result_evt(ctrl_data.iface, l2_results_evt);

			/* Store results for internal usage in cluster channel selection */
			if (ctrl_data.rssi_scan_data.current_results_index <
			    DECT_NRF91_CTRL_RSSI_SCAN_RESULTS_MAX_CHANNELS) {
				struct dect_nrf91_ctrl_rssi_scan_result_data results_item = {
					.channel = rssi_data->channel,
					.all_subslots_free = all_subslots_free,
					.scan_suitable_percent_ok = scan_suitable_percent_ok,
					.busy_percentage = rssi_data->busy_percentage,
					.busy_percentage_ok =
						(rssi_data->busy_percentage <
						(100 - set_ptr->net_mgmt_common
							.rssi_scan.scan_suitable_percent)),
					.another_cluster_detected_in_channel =
						channel_has_another_cluster,
					.possible_subslot_cnt = rssi_data->possible_subslot_cnt,
					.busy_subslot_cnt = rssi_data->busy_subslot_cnt,
				};

				ctrl_data.rssi_scan_data.results
					[ctrl_data.rssi_scan_data.current_results_index++] =
					results_item;
			}
			if (ctrl_data.rssi_scan_data.cmd_on_going) {
				/* Actual RSSI scanning command was running, let it run */
				break;
			}
			if ((channel_has_another_cluster == false &&
			     all_subslots_free && scan_suitable_percent_ok &&
			     rssi_data->busy_percentage == 0) &&
			    (ctrl_data.configure_params.auto_start ||
			     ctrl_data.ft_cluster_state == CTRL_FT_CLUSTER_STATE_STARTING) &&
			    (ctrl_data.configure_params.channel == 0)) {
				/* MAC spec, ch. 5.1.2:
				 * if any channel where all subslots are "free", is found,
				 * then select channel for the cluster & stop the scan.
				 * Additionally, we made this rule stricter, we checked
				 * that no other cluster is present in the channel and
				 * calculated busy percentage is also zero.
				 */
				ctrl_data.configure_params.channel = mdm_rssi_res->channel;

				err = nrf_modem_dect_mac_rssi_scan_stop();
				if (err) {
					dect_nrf91_utils_modem_mac_err_to_string(err, tmp_str);
					LOG_ERR("Error in RSSI scan stop: err %s (%d)", tmp_str,
						err);
				}
			}
			break;
		}
		case DECT_NRF91_CTRL_OP_MDM_RSSI_COMPLETE: {
			enum nrf_modem_dect_mac_err *status =
				(enum nrf_modem_dect_mac_err *)event.data;
			struct dect_nrf91_settings *set_ptr = dect_nrf91_settings_ref_get();

			dect_mgmt_rssi_scan_done_evt(
				ctrl_data.iface,
				dect_nrf91_utils_modem_status_to_net_mgmt_status(*status));

			if (*status != NRF_MODEM_DECT_MAC_STATUS_OK &&
			    !(ctrl_data.ft_cluster_reconfig_ongoing &&
				ctrl_data.configure_params.channel ==
				ctrl_data.ft_cluster_reconfig_prev_cluster_channel)) {

				dect_nrf91_utils_modem_mac_err_to_string(*status, tmp_str);

				LOG_ERR("Error in RSSI scan complete: err %s (%d)", tmp_str,
					*status);

				if (ctrl_data.ft_cluster_state == CTRL_FT_CLUSTER_STATE_STARTING) {
					if (ctrl_data.ft_cluster_reconfig_ongoing) {
						/* RSSI failure during reconfig, prev cluster conf
						 * still running
						 */
						ctrl_data.ft_cluster_state =
							CTRL_FT_CLUSTER_STATE_STARTED;
						ctrl_data.ft_cluster_reconfig_ongoing = false;
						ctrl_data.ft_requested_cluster_channel =
							DECT_CLUSTER_CHANNEL_ANY;
						ctrl_data.configure_params.channel =
							ctrl_data
							.ft_cluster_reconfig_prev_cluster_channel;

						LOG_WRN("RSSI scan failed on reconfig - "
							"keeping cluster running");
						break;
					}
					ctrl_data.ft_cluster_state = CTRL_FT_CLUSTER_STATE_NONE;
					ctrl_data.configure_params.channel = 0;
					ctrl_data.ft_requested_cluster_channel =
						DECT_CLUSTER_CHANNEL_ANY;
					dect_mgmt_cluster_created_evt(
						ctrl_data.iface,
						(struct dect_cluster_start_resp_evt){
							.status =
						dect_nrf91_utils_modem_status_to_net_mgmt_status(
							*status),
							.cluster_channel = 0,
						});
				}
				if (ctrl_data.ft_network_state != CTRL_FT_NETWORK_STATE_NONE) {
					struct dect_network_status_evt network_status_data = {
						.network_status = DECT_NETWORK_STATUS_FAILURE,
						.dect_err_cause =
						dect_nrf91_utils_modem_status_to_net_mgmt_status(
							*status),
					};

					ctrl_data.ft_network_state = CTRL_FT_NETWORK_STATE_NONE;
					dect_mgmt_network_status_evt(ctrl_data.iface,
								     network_status_data);
				}
				break;
			}
			LOG_INF("RSSI scan completed");
			if (ctrl_data.rssi_scan_data.cmd_on_going) {
				ctrl_data.rssi_scan_data.cmd_on_going = false;
				break;
			}
			if (!(ctrl_data.configure_params.auto_start ||
			    ctrl_data.ft_cluster_state == CTRL_FT_CLUSTER_STATE_STARTING)) {
				/* Not auto start or cluster start req - nothing to do here more */
				break;

			}

			if (ctrl_data.configure_params.channel == 0) {
				struct dect_nrf91_ctrl_rssi_scan_result_data best_rssi_meas;

				if (dect_nrf91_ctrl_rssi_scan_data_results_best_get(
					&best_rssi_meas)) {
					ctrl_data.configure_params.channel = best_rssi_meas.channel;
				} else {
					if (ctrl_data.ft_cluster_reconfig_ongoing) {
						/* Reconfig failure, existing cluster config
						 * still running
						 */
						LOG_WRN("No free enough channel found in "
							"RSSI scan,"
							" cannot reconfigure cluster");
						ctrl_data.ft_cluster_reconfig_ongoing =
							false;
						ctrl_data.ft_cluster_state =
							CTRL_FT_CLUSTER_STATE_STARTED;
						ctrl_data.configure_params.channel =
						ctrl_data
						.ft_cluster_reconfig_prev_cluster_channel;
						break;
					}
					LOG_ERR("No free enough channel found in RSSI scan,"
						" cannot start cluster");
					ctrl_data.ft_cluster_state =
						CTRL_FT_CLUSTER_STATE_NONE;
					dect_mgmt_cluster_created_evt(
						ctrl_data.iface,
						(struct dect_cluster_start_resp_evt){
							.status =
							DECT_MAC_STATUS_NO_RESOURCES,
							.cluster_channel = 0,
						});
					ctrl_data.ft_network_state =
						CTRL_FT_NETWORK_STATE_NONE;
					ctrl_data.ft_requested_cluster_channel =
						DECT_CLUSTER_CHANNEL_ANY;
					dect_mgmt_network_status_evt(
						ctrl_data.iface,
						(struct dect_network_status_evt){
							.network_status =
								DECT_NETWORK_STATUS_FAILURE,
							.dect_err_cause =
							DECT_MAC_STATUS_NO_RESOURCES,
						});
					break;
				}
			}
			/* TODO: own op evt for this: */
			LOG_INF("%s: starting a cluster on a channel %d.",
				ctrl_data.configure_params.auto_start ? "auto start"
								      : "cluster_start_req",
				ctrl_data.configure_params.channel);
			/* Start a cluster in a chosen channel */
			struct nrf_modem_dect_mac_cluster_config cluster_config = {
				.flags = {
						.has_max_tx_power = true,
						.has_rach_config = true,
					},
				.count_to_trigger = NRF_MODEM_DECT_MAC_COUNT_TO_TRIGGER_2,
				.relative_quality = NRF_MODEM_DECT_MAC_QUALITY_THRESHOLD_0,
				.min_quality = NRF_MODEM_DECT_MAC_QUALITY_THRESHOLD_0,
				.beacon_tx_power = dect_nrp_utils_dbm_to_phy_tx_power(
					set_ptr->net_mgmt_common.cluster.max_beacon_tx_power_dbm),
				.cluster_max_tx_power = dect_nrp_utils_dbm_to_phy_tx_power(
					set_ptr->net_mgmt_common.cluster.max_cluster_power_dbm),
				.cluster_beacon_period =
					set_ptr->net_mgmt_common.cluster.beacon_period,
				.cluster_channel = ctrl_data.configure_params.channel,
				.network_id = ctrl_data.configure_params.network_id,
				.rach_configuration = {
					 .policy =
						 NRF_MODEM_DECT_MAC_RACH_CONFIG_POLICY_FILL,
					 .common = {
							 .response_window_length = 8,
							 .max_transmission_length = 8,
							 .cw_min_sig = 2,
							 .cw_max_sig = 7,
						 },
					 .config = { .fill = {
								.percentage = 100,
							}}},
				.triggers = {
						.busy_threshold = 20,
					}
			};
			struct nrf_modem_dect_mac_association_config ass_config = {
				.max_num_neighbours =
					set_ptr->net_mgmt_common.cluster.max_num_neighbors,
				.max_num_ft_neighbours = 2,
				.neighbor_info_triggers = {
						.inactivity_timer = set_ptr->net_mgmt_common
							.cluster
							.neighbor_inactivity_disconnect_timer_ms,
					},
				.default_tx_flow_config = {
					{
						.dlc_service_type =
						NRF_MODEM_DECT_DLC_SERVICE_TYPE_3,
						.dlc_sdu_lifetime =
						NRF_MODEM_DECT_DLC_SDU_LIFETIME_60_S,
					},
					{
						.dlc_service_type =
							NRF_MODEM_DECT_DLC_SERVICE_TYPE_3,
						.dlc_sdu_lifetime =
						NRF_MODEM_DECT_DLC_SDU_LIFETIME_INFINITY,
					},
					{
						.priority = 3,
						.dlc_service_type =
							NRF_MODEM_DECT_DLC_SERVICE_TYPE_3,
						.dlc_sdu_lifetime =
						NRF_MODEM_DECT_DLC_SDU_LIFETIME_INFINITY,
					},
					{
						.priority = 4,
						.dlc_service_type =
							NRF_MODEM_DECT_DLC_SERVICE_TYPE_3,
						.dlc_sdu_lifetime =
						NRF_MODEM_DECT_DLC_SDU_LIFETIME_INFINITY,
					},
					{
						.priority = 5,
						.dlc_service_type =
							NRF_MODEM_DECT_DLC_SERVICE_TYPE_3,
						.dlc_sdu_lifetime =
						NRF_MODEM_DECT_DLC_SDU_LIFETIME_INFINITY,
					},
					{
						.priority = 6,
						.dlc_service_type =
							NRF_MODEM_DECT_DLC_SERVICE_TYPE_3,
						.dlc_sdu_lifetime =
						NRF_MODEM_DECT_DLC_SDU_LIFETIME_INFINITY,
					}},
			};
			struct nrf_modem_dect_mac_cluster_configure_params params = {
				.cluster_period_start_offset = 0,
				.association_config = &ass_config,
				.cluster_config = &cluster_config,
			};
			/* Set our IPv6 address prefix to modem to be passed to children */
			struct dect_nrf91_ipv6_prefix global_prefix;

			if (dect_nrf91_sink_ipv6_prefix_get(&global_prefix)) {
				/* Pass prefix to children */
				__ASSERT_NO_MSG(global_prefix.len == 8);
				memcpy(&cluster_config.ipv6_config.address,
				       global_prefix.prefix.s6_addr, global_prefix.len);
				cluster_config.ipv6_config.type =
					NRF_MODEM_DECT_MAC_IPV6_ADDRESS_TYPE_PREFIX;
			} else {
				/* Using link local (already set to us)*/
				cluster_config.ipv6_config.type =
					NRF_MODEM_DECT_MAC_IPV6_ADDRESS_TYPE_NONE;
				LOG_WRN("%s: no IPv6 prefix to set - using link local only",
					__func__);
			}
			if (ctrl_data.ft_cluster_reconfig_ongoing) {
				/* Use reconfigure params for certain cluster configs */
				cluster_config.beacon_tx_power =
					dect_nrp_utils_dbm_to_phy_tx_power(
						ctrl_data.ft_cluster_reconfig_params
							.max_beacon_tx_power_dbm);
				cluster_config.cluster_max_tx_power =
					dect_nrp_utils_dbm_to_phy_tx_power(
						ctrl_data.ft_cluster_reconfig_params
							.max_cluster_power_dbm);
				cluster_config.cluster_beacon_period =
					ctrl_data.ft_cluster_reconfig_params.period;
			}
			err = nrf_modem_dect_mac_cluster_configure(&params);
			if (err) {
				LOG_ERR("nrf_modem_dect_mac_cluster_configure returned err "
					"%d",
					err);
				if (ctrl_data.ft_cluster_reconfig_ongoing &&
				    ctrl_data.ft_cluster_state ==
					CTRL_FT_CLUSTER_STATE_STARTING) {
					/* Reconfig failure, existing cluster config
					 * still running
					 */
					ctrl_data.ft_cluster_state =
						CTRL_FT_CLUSTER_STATE_STARTED;
					ctrl_data.configure_params.channel =
						ctrl_data
						.ft_cluster_reconfig_prev_cluster_channel;
				} else if (ctrl_data.ft_network_state !=
				    CTRL_FT_NETWORK_STATE_NONE) {
					ctrl_data.ft_network_state =
						CTRL_FT_NETWORK_STATE_NONE;
					dect_mgmt_network_status_evt(
						ctrl_data.iface,
						(struct dect_network_status_evt){
							.network_status =
								DECT_NETWORK_STATUS_FAILURE,
							.dect_err_cause =
								DECT_MAC_STATUS_OS_ERROR,
							.os_err_cause = err,
						});
				}
				ctrl_data.ft_cluster_reconfig_ongoing = false;
				ctrl_data.ft_requested_cluster_channel =
					DECT_CLUSTER_CHANNEL_ANY;
			}
		break;
		}
		case DECT_NRF91_CTRL_OP_MDM_RSSI_STOPPED: {
			enum nrf_modem_dect_mac_err *status =
				(enum nrf_modem_dect_mac_err *)event.data;
			if (*status != NRF_MODEM_DECT_MAC_STATUS_OK) {
				dect_nrf91_utils_modem_mac_err_to_string(*status, tmp_str);

				LOG_ERR("Error in RSSI scan stop: err %s (%d)", tmp_str, *status);
			} else {
				LOG_INF("RSSI scan stopped");
			}
			break;
		}
		case DECT_NRF91_CTRL_OP_MDM_NW_BEACON_START: {
			struct dect_nw_beacon_start_req_params *params =
				(struct dect_nw_beacon_start_req_params *)event.data;
			struct dect_nrf91_settings *set_ptr = dect_nrf91_settings_ref_get();

			struct nrf_modem_dect_mac_network_beacon_configure_params beacon_params = {
				.channel = params->channel,
				.num_additional_channels = 0,
				.nw_beacon_period = set_ptr->net_mgmt_common
							.nw_beacon.beacon_period,
			};

			beacon_params.num_additional_channels = params->additional_ch_count;
			beacon_params.additional_channels = params->additional_ch_list;

