jhirsi/sdk-nrf/drivers/dect_nrp/nrf91_mac/dect_nrf91_ctrl.c
			LOG_INF("starting network beacon on a channel %d.", params->channel);

			err = nrf_modem_dect_mac_network_beacon_configure(&beacon_params);
			if (err) {
				LOG_ERR("nrf_modem_dect_mac_network_beacon_configure failed: %d",
					err);
				ctrl_data.ft_nw_beacon_state = CTRL_FT_NW_BEACON_STATE_NONE;
				dect_mgmt_nw_beacon_start_evt(
					ctrl_data.iface,
					dect_nrf91_utils_modem_status_to_net_mgmt_status(err));

				if (ctrl_data.ft_network_state != CTRL_FT_NETWORK_STATE_NONE) {
					ctrl_data.ft_network_state = CTRL_FT_NETWORK_STATE_NONE;
					dect_mgmt_network_status_evt(
						ctrl_data.iface,
						(struct dect_network_status_evt){
							.network_status =
								DECT_NETWORK_STATUS_FAILURE,
							.dect_err_cause = DECT_MAC_STATUS_OS_ERROR,
							.os_err_cause = err,
						});
				}
			} else {
				ctrl_data.ft_nw_beacon_state = CTRL_FT_NW_BEACON_STATE_STARTING;
			}
			break;
		}
		case DECT_NRF91_CTRL_OP_MDM_NW_BEACON_START_OR_STOP_DONE: {
			struct nrf_modem_dect_mac_network_beacon_configure_cb_params *evt_data =
				(struct nrf_modem_dect_mac_network_beacon_configure_cb_params *)
					event.data;

			if (evt_data->status != NRF_MODEM_DECT_MAC_STATUS_OK) {
				dect_nrf91_utils_modem_mac_err_to_string(evt_data->status, tmp_str);

				LOG_ERR("Error in network beacon start/stop: err %s (%d)", tmp_str,
					evt_data->status);
				if (ctrl_data.ft_nw_beacon_state ==
				    CTRL_FT_NW_BEACON_STATE_STOPPING) {
					dect_mgmt_nw_beacon_stop_evt(
						ctrl_data.iface,
						dect_nrf91_utils_modem_status_to_net_mgmt_status(
							evt_data->status));
				} else if (ctrl_data.ft_nw_beacon_state ==
					   CTRL_FT_NW_BEACON_STATE_STARTING) {
					dect_mgmt_nw_beacon_start_evt(
						ctrl_data.iface,
						dect_nrf91_utils_modem_status_to_net_mgmt_status(
							evt_data->status));

					/* Eventhough nw beacon failed, cluster is still running*/
					if (ctrl_data.ft_network_state ==
					    CTRL_FT_NETWORK_STATE_STARTING) {
						dect_mgmt_network_status_evt(
							ctrl_data.iface,
							(struct dect_network_status_evt){
								.network_status =
									DECT_NETWORK_STATUS_CREATED,
							});
						LOG_WRN("Network beacon start failed, "
							"but cluster is still running");
					}
					ctrl_data.ft_network_state = CTRL_FT_NETWORK_STATE_CREATED;
				}
				ctrl_data.ft_nw_beacon_state = CTRL_FT_NW_BEACON_STATE_NONE;
			} else {
				if (ctrl_data.ft_nw_beacon_state ==
				    CTRL_FT_NW_BEACON_STATE_STARTING) {
					LOG_INF("Network beacon started");
					ctrl_data.ft_nw_beacon_state =
						CTRL_FT_NW_BEACON_STATE_STARTED;
					dect_mgmt_nw_beacon_start_evt(ctrl_data.iface,
								      DECT_MAC_STATUS_OK);
					ctrl_data.ft_network_state = CTRL_FT_NETWORK_STATE_CREATED;
					dect_mgmt_network_status_evt(
						ctrl_data.iface,
						(struct dect_network_status_evt){
							.network_status =
								DECT_NETWORK_STATUS_CREATED,
						});
				} else {
					__ASSERT_NO_MSG(ctrl_data.ft_nw_beacon_state ==
							CTRL_FT_NW_BEACON_STATE_STOPPING);
					LOG_INF("Network beacon stopped");
					ctrl_data.ft_nw_beacon_state = CTRL_FT_NW_BEACON_STATE_NONE;
					dect_mgmt_nw_beacon_stop_evt(ctrl_data.iface,
								     DECT_MAC_STATUS_OK);
				}
			}
			break;
		}
		case DECT_NRF91_CTRL_OP_MDM_NW_BEACON_STOP: {
			struct nrf_modem_dect_mac_network_beacon_configure_params beacon_params = {
				.channel = 0,
				.num_additional_channels = 0,
			};

			LOG_INF("Stopping network beacon.");

			err = nrf_modem_dect_mac_network_beacon_configure(&beacon_params);
			if (err) {
				dect_nrf91_utils_modem_mac_err_to_string(err, tmp_str);
				LOG_ERR("nrf_modem_dect_mac_network_beacon_configure failed: %s "
					"(%d)",
					tmp_str, err);
				ctrl_data.ft_nw_beacon_state = CTRL_FT_NW_BEACON_STATE_NONE;
				dect_mgmt_nw_beacon_stop_evt(ctrl_data.iface,
							     DECT_MAC_STATUS_OS_ERROR);
			} else {
				ctrl_data.ft_nw_beacon_state = CTRL_FT_NW_BEACON_STATE_STOPPING;
			}
			break;
		}

		case DECT_NRF91_CTRL_OP_MDM_CLUSTER_BEACON_RCVD: {
			/* TODO: PT mobility? we are getting these for every
			 * received beacon when associated and we have a rssi level from rx
			 * rx_signal_info -> poor enough could be used for mobility trigger?
			 */
			struct nrf_modem_dect_mac_cluster_beacon_ntf_cb_params *params = event.data;
			struct dect_nrf91_settings *set_ptr = dect_nrf91_settings_ref_get();
			bool add_to_cluster_channels = ctrl_data.scan_data.on_going;

			/* Did we already mark this to cluster_channels? */
			for (int i = 0; i < DECT_NRF91_CTRL_CLUSTER_SCAN_DATA_MAX_CHANNELS &&
			     add_to_cluster_channels; i++) {
				if (ctrl_data.scan_data.cluster_channels[i].channel ==
				    params->channel) {
					add_to_cluster_channels = false;
					break;
				}
			}
			/* Store channel and RSSI: used by FT when creating a cluster and
			 * when PT selecting RD for association.
			 */
			if (add_to_cluster_channels) {
				ctrl_data.scan_data.cluster_channels[
					ctrl_data.scan_data.current_cluster_channel_index].channel =
					params->channel;
				ctrl_data.scan_data.cluster_channels[
					ctrl_data.scan_data.current_cluster_channel_index].rssi_2 =
						params->rx_signal_info.rssi_2;
				ctrl_data.scan_data.cluster_channels[
					ctrl_data.scan_data.current_cluster_channel_index]
						.long_rd_id = params->transmitter_long_rd_id;

				ctrl_data.scan_data.current_cluster_channel_index++;
				__ASSERT_NO_MSG(ctrl_data.scan_data.current_cluster_channel_index <
						ARRAY_SIZE(ctrl_data.scan_data.cluster_channels));
			}
			if (ctrl_data.scan_data.scan_result_cb) {
				struct dect_scan_result_evt scan_result = {
					.beacon_type = DECT_SCAN_RESULT_TYPE_CLUSTER_BEACON,
					.channel = params->channel,
					.transmitter_short_rd_id = params->transmitter_short_rd_id,
					.transmitter_long_rd_id = params->transmitter_long_rd_id,
					.network_id = params->network_id,
					.rx_signal_info.mcs = params->rx_signal_info.mcs,
					.rx_signal_info.transmit_power =
						params->rx_signal_info.transmit_power,
					.rx_signal_info.rssi_2 = params->rx_signal_info.rssi_2,
					.rx_signal_info.snr = params->rx_signal_info.snr,
				};

				ctrl_data.scan_data.scan_result_cb(ctrl_data.iface, 0,
								   &scan_result);
			}
			if (set_ptr->net_mgmt_common.device_type != DECT_DEVICE_TYPE_PT) {
				/* Cluster beacon can be also received if FT device and
				 * if same short nw id and in same channel
				 */
				LOG_DBG("Cluster beacon received, but not PT device!!!");
				break;
			}
			if (ctrl_data.ass_config.pt_association_state !=
				CTRL_PT_ASSOCIATION_STATE_ASSOCIATED &&
			    dect_nrf91_utils_cluster_acceptable_for_association(params)) {
				ctrl_data.ass_config.pt_association_state =
					CTRL_PT_ASSOCIATION_STATE_CLUSTER_BEACON_RECEIVED;
				ctrl_data.ass_config.network_id = params->network_id;
				ctrl_data.ass_config.parent_long_rd_id =
					params->transmitter_long_rd_id;

				if (ctrl_data.configure_params.auto_start) {
					if (nrf_modem_dect_mac_network_scan_stop() != 0) {
						LOG_ERR("OP_MDM_CLUSTER_BEACON_RCVD: error in "
							"Network scan stop!");
					} else {
						LOG_DBG("nw scan stopping requested");
					}
				}
			}
			if (ctrl_data.ass_config.pt_association_state ==
			    CTRL_PT_ASSOCIATION_STATE_ASSOCIATED &&
			    set_ptr->net_mgmt_common.association.min_sensitivity_dbm >=
			    params->rx_signal_info.rssi_2) {
				LOG_WRN("Signal (rssi_2 %d) is below the minimum "
					"sensitivity threshold (%d)",
					params->rx_signal_info.rssi_2,
					set_ptr->net_mgmt_common.association.min_sensitivity_dbm);
			}
			break;
		}
		case DECT_NRF91_CTRL_OP_MDM_NW_BEACON_RCVD: {
			struct nrf_modem_dect_mac_network_beacon_ntf_cb_params *params = event.data;
			struct dect_nrf91_settings *set_ptr = dect_nrf91_settings_ref_get();

			LOG_DBG("Network beacon information:");
			LOG_DBG("  network id (32bit).............................%u (0x%08x)",
				params->network_id, params->network_id);
			LOG_DBG("  transmitter id (long RD ID)....................%u (0x%08x)",
				params->transmitter_long_rd_id, params->transmitter_long_rd_id);
			LOG_DBG("  short RD ID....................................%u (0x%04x)",
				params->transmitter_short_rd_id, params->transmitter_short_rd_id);
			LOG_DBG("  channel number.................................%d",
				params->channel);
			LOG_DBG("  next_cluster_channel number....................%d",
				params->beacon.next_cluster_channel);

			if (ctrl_data.scan_data.scan_result_cb) {
				struct dect_scan_result_evt scan_result = {
					.beacon_type = DECT_SCAN_RESULT_TYPE_NW_BEACON,
					.channel = params->channel,
					.transmitter_short_rd_id = params->transmitter_short_rd_id,
					.transmitter_long_rd_id = params->transmitter_long_rd_id,
					.network_id = params->network_id,
					.rx_signal_info.mcs = params->rx_signal_info.mcs,
					.rx_signal_info.transmit_power =
						params->rx_signal_info.transmit_power,
					.rx_signal_info.rssi_2 = params->rx_signal_info.rssi_2,
					.rx_signal_info.snr = params->rx_signal_info.snr,
				};
				struct dect_network_beacon_data nw_beacon = {
					.next_cluster_channel = params->beacon.next_cluster_channel,
					.current_cluster_channel =
						params->beacon.current_cluster_channel,
					.num_network_beacon_channels =
						params->beacon.num_network_beacon_channels,
				};

				for (int i = 0; i < params->beacon.num_network_beacon_channels;
				     i++) {
					nw_beacon.network_beacon_channels[i] =
						params->beacon.network_beacon_channels[i];
				}
				scan_result.network_beacon = nw_beacon;
				ctrl_data.scan_data.scan_result_cb(ctrl_data.iface, 0,
								   &scan_result);
			}

