jhirsi/sdk-nrf/drivers/dect_nrp/nrf91_mac/dect_nrf91_ctrl.c
			if (set_ptr->net_mgmt_common.device_type == DECT_DEVICE_TYPE_PT &&
			    ctrl_data.ass_config.pt_association_state !=
				    CTRL_PT_ASSOCIATION_STATE_ASSOCIATED) {
				ctrl_data.ass_config.pt_association_state =
					CTRL_PT_ASSOCIATION_STATE_CLUSTER_FOUND;
				ctrl_data.ass_config.network_id = params->network_id;
				ctrl_data.ass_config.parent_long_rd_id =
					params->transmitter_long_rd_id;

				if (ctrl_data.configure_params.auto_start &&
				    (set_ptr->net_mgmt_common.network_join.target_ft_long_rd_id ==
					     DECT_SETT_NETWORK_JOIN_TARGET_FT_ANY ||
				     set_ptr->net_mgmt_common.network_join.target_ft_long_rd_id ==
					     params->transmitter_long_rd_id)) {
					err = nrf_modem_dect_mac_network_scan_stop();
					if (err) {
						LOG_ERR("%s: error in stopping nw scan, err: %d",
							(__func__), err);
					}
				}
			}

			break;
		}
		case DECT_NRF91_CTRL_OP_MDM_NW_SCAN_COMPLETE: {
			struct nrf_modem_dect_mac_network_scan_cb_params *evt_data =
				(struct nrf_modem_dect_mac_network_scan_cb_params *)event.data;
			struct dect_nrf91_settings *set_ptr = dect_nrf91_settings_ref_get();

			if (evt_data->status != NRF_MODEM_DECT_MAC_STATUS_OK) {
				dect_nrf91_utils_modem_mac_err_to_string(evt_data->status, tmp_str);

				LOG_ERR("Network scan completed with err %s (%d)", tmp_str,
					evt_data->status);
				/* TODO: send nw status with error if doing a join? */
			} else {
				LOG_INF("Network scan completed: %d channels scanned",
					evt_data->num_scanned_channels);
			}
			ctrl_data.scan_data.on_going = false;
			if (ctrl_data.scan_data.scan_result_cb) {
				ctrl_data.scan_data.scan_result_cb(
					ctrl_data.iface,
					dect_nrf91_utils_modem_status_to_net_mgmt_status(
						evt_data->status),
					NULL);
				ctrl_data.scan_data.scan_result_cb = NULL;
			}
			if (!ctrl_data.configure_params.auto_start) {
				/* We are done here */
				break;
			}
			if (set_ptr->net_mgmt_common.device_type == DECT_DEVICE_TYPE_PT) {
				if (ctrl_data.ass_config.pt_association_state ==
				    CTRL_PT_ASSOCIATION_STATE_CLUSTER_FOUND) {
					LOG_INF("auto start: sending cluster beacon receive req, "
						"Long RD ID: 0x%X, NW ID: 0x%X",
						ctrl_data.ass_config.parent_long_rd_id,
						ctrl_data.ass_config.network_id);

					struct nrf_modem_dect_mac_cluster_beacon_config
						cluster_config = {
							.long_rd_id = ctrl_data.ass_config
									      .parent_long_rd_id,
							.network_id =
								ctrl_data.ass_config.network_id,
						};
					struct nrf_modem_dect_mac_cluster_beacon_receive_params
						params = {
							.num_configs = 1,
							.configs = &cluster_config,
						};

					err = nrf_modem_dect_mac_cluster_beacon_receive(&params);
					if (err) {
						LOG_ERR("Error in Cluster beacon receive: err %d",
							err);
					}
				} else if (ctrl_data.ass_config.pt_association_state ==
					   CTRL_PT_ASSOCIATION_STATE_CLUSTER_BEACON_RECEIVED) {
					dect_mac_ctrl_trigger_association();
				} else {
					struct dect_nrf91_ctrl_cluster_channel_list_item
						best_channel_data;
					bool best_channel_found =
					dect_nrf91_ctrl_cluster_channels_list_best_channel_get(
						&best_channel_data);

					/* MAC spec 5.1.4:
					 * If none of the detected cluster beacons meets
					 * the minimum quality level, the RD may:
					 * - initiate association to the RD providing
					 * the highest RSSI-2 value
					 */
					if (best_channel_found) {
						LOG_INF("Nw scan done: selecting best channel: "
							"Long RD ID: 0x%X, RSSI-2: %d",
							best_channel_data.long_rd_id,
							best_channel_data.rssi_2);
						ctrl_data.ass_config.pt_association_state =
						CTRL_PT_ASSOCIATION_STATE_CLUSTER_BEACON_RECEIVED;
						ctrl_data.ass_config.network_id =
							set_ptr->net_mgmt_common.identities
								.network_id;
						ctrl_data.ass_config.parent_long_rd_id =
							best_channel_data.long_rd_id;
						dect_mac_ctrl_trigger_association();
					} else {
						dect_mgmt_network_status_evt(
							ctrl_data.iface,
							(struct dect_network_status_evt){
								.network_status =
								DECT_NETWORK_STATUS_FAILURE,
								.dect_err_cause =
								DECT_MAC_STATUS_RD_NOT_FOUND,
							});
						LOG_WRN("No cluster found with NW scan");
						ctrl_data.configure_params.auto_start = false;
					}
				}
			} else {
				struct dect_nrf91_settings *set_ptr = dect_nrf91_settings_ref_get();
				/* As a default RSSI params from settings  */
				struct nrf_modem_dect_mac_rssi_scan_params params = {
					.channel_scan_length =
						set_ptr->net_mgmt_common.rssi_scan
							.time_per_channel_ms / 10,
					.threshold_min =
						set_ptr->net_mgmt_common.rssi_scan
							.free_threshold_dbm,
					.threshold_max =
						set_ptr->net_mgmt_common.rssi_scan
							.busy_threshold_dbm,
					.num_channels = 0,
					.band = set_ptr->net_mgmt_common.band_nbr,
				};

				__ASSERT_NO_MSG(
					set_ptr->net_mgmt_common.device_type ==
						DECT_DEVICE_TYPE_FT);
				if (ctrl_data.ft_requested_cluster_channel !=
					DECT_CLUSTER_CHANNEL_ANY) {
					params.num_channels = 1;
					params.channel_list[0] =
						ctrl_data.ft_requested_cluster_channel;
				}

				dect_nrf91_ctrl_msgq_data_op_add(
					DECT_NRF91_CTRL_OP_RSSI_START_REQ_CH_SELECTION,
					&params,
					sizeof(struct nrf_modem_dect_mac_rssi_scan_params));
			}
			break;
		}
		case DECT_NRF91_CTRL_OP_MDM_NW_SCAN_STOPPED: {
			enum nrf_modem_dect_mac_err *status =
				(enum nrf_modem_dect_mac_err *)event.data;

			if (*status != NRF_MODEM_DECT_MAC_STATUS_OK) {
				dect_nrf91_utils_modem_mac_err_to_string(*status, tmp_str);
				LOG_ERR("Network scan stopping failed with err %s (%d)", tmp_str,
					*status);
				break;
			}
			LOG_INF("Network scan stopped");
			break;
		}
		case DECT_NRF91_CTRL_OP_MDM_CLUSTER_RCV_COMPLETE: {
			enum nrf_modem_dect_mac_err *status =
				(enum nrf_modem_dect_mac_err *)event.data;

			if (*status != NRF_MODEM_DECT_MAC_STATUS_OK) {
				dect_nrf91_utils_modem_mac_err_to_string(*status, tmp_str);
				LOG_ERR("Cluster beacon rcv failed with err %s (%d)", tmp_str,
					*status);
				break;
			}
			LOG_INF("Cluster beacon reception completed");

			if (ctrl_data.configure_params.auto_start) {
				if (ctrl_data.ass_config.pt_association_state ==
				    CTRL_PT_ASSOCIATION_STATE_CLUSTER_BEACON_RECEIVED) {
					dect_mac_ctrl_trigger_association();
				} else {
					LOG_WRN("No cluster found with Cluster beacon receive");
				}
			}
			/* TODO some event to detect channel & other changes */
			break;
		}
		case DECT_NRF91_CTRL_OP_MDM_CLUSTER_INFO: {
			struct nrf_modem_dect_mac_cluster_info_cb_params *evt_data = event.data;
			struct dect_cluster_info_evt l2_results_evt = {
				.status = dect_nrf91_utils_modem_status_to_net_mgmt_status(
					evt_data->status),
			};
			struct dect_cluster_status_info *cluster_info = &l2_results_evt.status_info;
			struct dect_rssi_scan_result_data *rssi_result = &cluster_info->rssi_result;

