jhirsi/sdk-nrf/drivers/dect_nrp/nrf91_mac/dect_nrf91_ctrl.c
			if (evt_data->status != NRF_MODEM_DECT_MAC_STATUS_OK) {
				dect_nrf91_utils_modem_mac_err_to_string(evt_data->status, tmp_str);
				LOG_ERR("Cluster info rcv failed with err %s (%d)", tmp_str,
					evt_data->status);
			} else {
				cluster_info->num_association_failures =
					evt_data->info.num_association_failures;
				cluster_info->num_association_requests =
					evt_data->info.num_association_requests;
				cluster_info->num_neighbors = evt_data->info.num_neighbors;
				cluster_info->num_ftpt_neighbors =
					evt_data->info.num_ftpt_neighbors;
				cluster_info->num_rach_rx_pdc = evt_data->info.num_rach_rx_pdc;
				cluster_info->num_rach_rx_pcc_crc_failures =
					evt_data->info.num_rach_rx_pcc_crc_failures;
				cluster_info->rssi_result.busy_percentage =
					evt_data->info.rssi_result.busy_percentage;

				LOG_DBG("Cluster status information:");
				LOG_DBG("  num_association_requests.......................%u",
					evt_data->info.num_association_requests);
				LOG_DBG("  num_association_failures.......................%u",
					evt_data->info.num_association_failures);
				LOG_DBG("  num_neighbors..................................%u",
					evt_data->info.num_neighbors);
				LOG_DBG("  num_ftpt_neighbors.............................%u",
					evt_data->info.num_ftpt_neighbors);
				LOG_DBG("  num_rach_rx_pdc................................%u",
					evt_data->info.num_rach_rx_pdc);
				LOG_DBG("  num_rach_rx_pcc_crc_fail.......................%u",
					evt_data->info.num_rach_rx_pcc_crc_failures);
				LOG_DBG("  channel busy percentage........................%u",
					evt_data->info.rssi_result.busy_percentage);

				struct nrf_modem_dect_mac_rssi_result *mdm_rssi_res =
					&evt_data->info.rssi_result;
				int err = dect_nrf91_utils_mdm_rssi_results_to_l2_rssi_data(
					mdm_rssi_res, rssi_result);

				if (err) {
					LOG_ERR("Error in converting RSSI results to L2 data: %d",
						err);
				}
			}
			/* Send L2 evt */
			dect_mgmt_cluster_info_evt(ctrl_data.iface, l2_results_evt);

			break;
		}
		case DECT_NRF91_CTRL_OP_CLUSTER_BEACON_RX_FAILURE: {
			struct nrf_modem_dect_mac_cluster_beacon_rx_failure_ntf_cb_params
				*evt_data =
					(struct
					 nrf_modem_dect_mac_cluster_beacon_rx_failure_ntf_cb_params
						 *)event.data;
			struct dect_nrf91_settings *set_ptr = dect_nrf91_settings_ref_get();

			LOG_INF("Max nbr of cluster beacon RX failures (%d): long_rd_id %u (0x%X)",
				set_ptr->net_mgmt_common.association.max_beacon_rx_failures,
				evt_data->long_rd_id, evt_data->long_rd_id);

			/* OK, configured max amount of cluster beacon RX failures, so we can
			 * start a dissociation process.
			 */
			if (ctrl_data.ass_config.pt_association_state ==
			    CTRL_PT_ASSOCIATION_STATE_ASSOCIATED) {
				__ASSERT_NO_MSG(
					ctrl_data.ass_config.parent_long_rd_id ==
						evt_data->long_rd_id);
				LOG_INF("Starting releasing the association");
				dect_nrf91_ctrl_api_associate_release_cmd(
					ctrl_data.ass_config.parent_long_rd_id,
					NRF_MODEM_DECT_MAC_RELEASE_CAUSE_LONG_INACTIVITY);
			}
			break;
		}
		case DECT_NRF91_CTRL_OP_NEIGHBOR_PAGING_FAILURE: {
			/* Message is an indication that a neighbor is tried to be paged for
			 * incoming data but there was no answer. We release the association.
			 */
			struct nrf_modem_dect_mac_neighbor_paging_failure_ntf_cb_params *params =
				(struct nrf_modem_dect_mac_neighbor_paging_failure_ntf_cb_params *)
					event.data;

			LOG_WRN("Neighbor paging failure: long_rd_id %u (0x%X) - "
				"releasing association",
				params->long_rd_id, params->long_rd_id);

			dect_nrf91_ctrl_api_associate_release_cmd(
				params->long_rd_id,
				NRF_MODEM_DECT_MAC_RELEASE_CAUSE_BAD_RADIO_QUALITY);
			break;
		}
		case DECT_NRF91_CTRL_OP_MDM_NEIGHBOR_INFO: {
			struct nrf_modem_dect_mac_neighbor_info_cb_params *evt_data = event.data;
			struct dect_neighbor_info_evt l2_results_evt = {
				.long_rd_id = evt_data->long_rd_id,
				.status = dect_nrf91_utils_modem_status_to_net_mgmt_status(
					evt_data->status),
			};

			if (evt_data->status != NRF_MODEM_DECT_MAC_STATUS_OK) {
				dect_nrf91_utils_modem_mac_err_to_string(evt_data->status, tmp_str);
				LOG_ERR("Neighbor info rcv failed with err %s (%d)", tmp_str,
					evt_data->status);
			} else {
				LOG_DBG("Neighbor status information:");
				LOG_DBG("  Neighbor (long RD ID).......................%u (0x%08x)",
					evt_data->long_rd_id, evt_data->long_rd_id);
				LOG_DBG("  Network ID..................................%u (0x%08x)",
					evt_data->network_id, evt_data->network_id);
				LOG_DBG("  Associated..................................%s",
					evt_data->associated ? "true" : "false");
				LOG_DBG("  FT mode.....................................%s",
					evt_data->ft_mode ? "true" : "false");
				LOG_DBG("  Channel.....................................%d",
					evt_data->channel);
				LOG_DBG("  Time in ms since neighbor is last seen......%u ms",
					evt_data->time_since_last_rx_ms);
				LOG_DBG("  RX mcs......................................%u",
					evt_data->last_rx_signal_info.mcs);
				LOG_DBG("  RX transmit power...........................%d",
					evt_data->last_rx_signal_info.transmit_power);
				LOG_DBG("  RX RSSI 2...................................%d",
					evt_data->last_rx_signal_info.rssi_2);
				LOG_DBG("  RX SNR.....................................%d",
					evt_data->last_rx_signal_info.snr);
				LOG_DBG("  beacon_average_rx_rssi_2..................%d",
					evt_data->beacon_average_rx_rssi_2);
				LOG_DBG("  beacon_average_rx_snr.......................%d",
					evt_data->beacon_average_rx_snr);
				l2_results_evt.network_id = evt_data->network_id;
				l2_results_evt.associated = evt_data->associated;
				l2_results_evt.ft_mode = evt_data->ft_mode;
				l2_results_evt.channel = evt_data->channel;
				l2_results_evt.time_since_last_rx_ms =
					evt_data->time_since_last_rx_ms;
				l2_results_evt.last_rx_signal_info.mcs =
					evt_data->last_rx_signal_info.mcs;
				l2_results_evt.last_rx_signal_info.transmit_power =
					evt_data->last_rx_signal_info.transmit_power;
				l2_results_evt.last_rx_signal_info.rssi_2 =
					evt_data->last_rx_signal_info.rssi_2;
				l2_results_evt.last_rx_signal_info.snr =
					evt_data->last_rx_signal_info.snr;
				l2_results_evt.beacon_average_rx_txpower =
					evt_data->beacon_average_rx_txpower;
				l2_results_evt.beacon_average_rx_rssi_2 =
					evt_data->beacon_average_rx_rssi_2;
				l2_results_evt.beacon_average_rx_snr =
					evt_data->beacon_average_rx_snr;

				LOG_DBG("  total_missed_cluster_beacons................%u",
					evt_data->status_info.total_missed_cluster_beacons);
				LOG_DBG("  current_consecutive_missed_cluster_beacons..%u",
					evt_data->status_info
						.current_consecutive_missed_cluster_beacons);
				LOG_DBG("  num_rx_paging...............................%u",
					evt_data->status_info.num_rx_paging);
				LOG_DBG("  average_rx_mcs..............................%u",
					evt_data->status_info.average_rx_mcs);
				LOG_DBG("  average_rx_txpower..........................%d",
					evt_data->status_info.average_rx_txpower);
				LOG_DBG("  average_rx_rssi_2...........................%d",
					evt_data->status_info.average_rx_rssi_2);
				LOG_DBG("  average_rx_snr..............................%d",
					evt_data->status_info.average_rx_snr);
				LOG_DBG("  average_tx_mcs..............................%u",
					evt_data->status_info.average_tx_mcs);
				LOG_DBG("  average_tx_txpower..........................%d",
					evt_data->status_info.average_tx_txpower);
				LOG_DBG("  num_tx_attempts.............................%u",
					evt_data->status_info.num_tx_attempts);
				LOG_DBG("  num_lbt_failures............................%u",
					evt_data->status_info.num_lbt_failures);
				LOG_DBG("  num_rx_pdc..................................%u",
					evt_data->status_info.num_rx_pdc);
				LOG_DBG("  num_rx_pdc_crc_fail.........................%u",
					evt_data->status_info.num_rx_pdc_crc_failures);
				LOG_DBG("  num_no_response.............................%u",
					evt_data->status_info.num_no_response);
				LOG_DBG("  num_harq_ack................................%u",
					evt_data->status_info.num_harq_ack);
				LOG_DBG("  num_harq_nack...............................%u",
					evt_data->status_info.num_harq_nack);
				LOG_DBG("  num_arq_retx................................%u",
					evt_data->status_info.num_arq_retx);
				LOG_DBG("  inactive_time_ms............................%u ms",
					evt_data->status_info.inactive_time_ms);

