jhirsi/sdk-nrf/drivers/dect_nrp/nrf91_mac/dect_nrf91_ctrl.c
				l2_results_evt.status_info.total_missed_cluster_beacons =
					evt_data->status_info.total_missed_cluster_beacons;
				l2_results_evt.status_info
					.current_consecutive_missed_cluster_beacons =
					evt_data->status_info
						.current_consecutive_missed_cluster_beacons;
				l2_results_evt.status_info.num_rx_paging =
					evt_data->status_info.num_rx_paging;
				l2_results_evt.status_info.average_rx_mcs =
					evt_data->status_info.average_rx_mcs;
				l2_results_evt.status_info.average_rx_txpower =
					evt_data->status_info.average_rx_txpower;
				l2_results_evt.status_info.average_rx_rssi_2 =
					evt_data->status_info.average_rx_rssi_2;
				l2_results_evt.status_info.average_rx_snr =
					evt_data->status_info.average_rx_snr;
				l2_results_evt.status_info.average_tx_mcs =
					evt_data->status_info.average_tx_mcs;
				l2_results_evt.status_info.average_tx_txpower =
					evt_data->status_info.average_tx_txpower;
				l2_results_evt.status_info.num_tx_attempts =
					evt_data->status_info.num_tx_attempts;
				l2_results_evt.status_info.num_lbt_failures =
					evt_data->status_info.num_lbt_failures;
				l2_results_evt.status_info.num_rx_pdc =
					evt_data->status_info.num_rx_pdc;
				l2_results_evt.status_info.num_rx_pdc_crc_failures =
					evt_data->status_info.num_rx_pdc_crc_failures;
				l2_results_evt.status_info.num_no_response =
					evt_data->status_info.num_no_response;
				l2_results_evt.status_info.num_harq_ack =
					evt_data->status_info.num_harq_ack;
				l2_results_evt.status_info.num_harq_nack =
					evt_data->status_info.num_harq_nack;
				l2_results_evt.status_info.num_arq_retx =
					evt_data->status_info.num_arq_retx;
				l2_results_evt.status_info.inactive_time_ms =
					evt_data->status_info.inactive_time_ms;
			}

			/* Send L2 evt */
			dect_mgmt_neighbor_info_evt(ctrl_data.iface, l2_results_evt);
			break;
		}
		case DECT_NRF91_CTRL_OP_MDM_NEIGHBOR_LIST: {
			struct dect_nrf91_ctrl_neighbor_list_resp_evt *evt_data =
				(struct dect_nrf91_ctrl_neighbor_list_resp_evt *)event.data;
			struct dect_neighbor_list_evt l2_results_evt;

			l2_results_evt.neighbor_count = evt_data->num_neighbors;
			l2_results_evt.status =
				dect_nrf91_utils_modem_status_to_net_mgmt_status(evt_data->status);

			if (evt_data->status != NRF_MODEM_DECT_MAC_STATUS_OK) {
				dect_nrf91_utils_modem_mac_err_to_string(evt_data->status, tmp_str);
				LOG_ERR("Neighbor list rcv failed with err %s (%d)", tmp_str,
					evt_data->status);

				l2_results_evt.neighbor_count = 0;
				dect_mgmt_neighbor_list_evt(ctrl_data.iface, l2_results_evt);
				break;
			}

			LOG_DBG("Neighbors:");
			LOG_DBG("  num_neighbors..................................%u",
				evt_data->num_neighbors);
			for (uint32_t i = 0; i < evt_data->num_neighbors; i++) {
				LOG_DBG("  Neighbor (long RD ID)..........................%u "
					"(0x%08x)",
					evt_data->neighbor_long_rd_ids[i],
					evt_data->neighbor_long_rd_ids[i]);
				if (i >= DECT_L2_MAX_NEIGHBOR_LIST_ITEM_COUNT) {
					LOG_ERR("Neighbor list too long, max is %d",
						DECT_L2_MAX_NEIGHBOR_LIST_ITEM_COUNT);
					l2_results_evt.neighbor_count =
						DECT_L2_MAX_NEIGHBOR_LIST_ITEM_COUNT;
					break;
				}
				l2_results_evt.neighbor_long_rd_ids[i] =
					evt_data->neighbor_long_rd_ids[i];
			}
			dect_mgmt_neighbor_list_evt(ctrl_data.iface, l2_results_evt);
			break;
		}
		case DECT_NRF91_CTRL_OP_MDM_FLOW_CONTROL: {
			struct nrf_modem_dect_dlc_flow_control_ntf_cb_params *evt_data = event.data;

			k_mutex_lock(&dect_mac_ctrl_data_mtx, K_FOREVER);
			ctrl_data.tx_mdm_flow_ctrl_on =
				evt_data->status == NRF_MODEM_DECT_DLC_FLOW_CTRL_STATUS_ON ? true
											   : false;
			k_mutex_unlock(&dect_mac_ctrl_data_mtx);

			LOG_DBG("Flow control %s:",
				evt_data->status == NRF_MODEM_DECT_DLC_FLOW_CTRL_STATUS_ON ? "ON"
											   : "OFF");
			break;
		}
		case DECT_NRF91_CTRL_OP_MDM_DLC_DATA_RESP: {
#if defined(CONFIG_DECT_NRP_MAC_NRF_TX_FLOW_CTRL_BASED_ON_MDM_TX_DLC_REQS)
			struct dect_nrf91_ctrl_dlc_data_tx_resp_evt *evt_data = event.data;
			int arr_index;

			if (evt_data->status != NRF_MODEM_DECT_MAC_STATUS_OK) {
				dect_nrf91_utils_modem_mac_err_to_string(evt_data->status, tmp_str);
				LOG_ERR("DLC data TX response failed to rd id %u with err %s (%d), "
					"transaction id %u",
					evt_data->long_rd_id, tmp_str, evt_data->status,
					evt_data->acked_data[0].transaction_id);
			}

			/* Update total_unacked_tx_data_amount (even if is error) */
			k_mutex_lock(&dect_mac_ctrl_data_mtx, K_FOREVER);
			for (int i = 0; i < evt_data->num_acked_data; i++) {
				arr_index = evt_data->acked_data[i].transaction_id -
					    DECT_MAC_DATA_TX_HANDLE_START;
				if (arr_index < 0 ||
				    arr_index >= DECT_NRF91_DLC_DATA_INFO_MAX_COUNT) {
					LOG_ERR("Transaction ID %d not found in array",
						evt_data->acked_data[i].transaction_id);
					continue;
				}
				ctrl_data.dlc_data_tx_infos[arr_index].req_on_going = false;
				ctrl_data.total_unacked_tx_data_amount -=
					ctrl_data.dlc_data_tx_infos[arr_index].data_len;
				ctrl_data.total_unacked_req_amount--;
			}
			k_mutex_unlock(&dect_mac_ctrl_data_mtx);
			LOG_DBG("DLC data response (towards RD ID %u): "
				"total %d bytes unacked left, total req count %d",
				evt_data->long_rd_id,
				ctrl_data.total_unacked_tx_data_amount,
				ctrl_data.total_unacked_req_amount);
#endif
			break;
		}
		case DECT_NRF91_CTRL_OP_MDM_ASSOCIATION_IND: {
			struct nrf_modem_dect_mac_association_ntf_cb_params *params = event.data;

			if (params->status !=
			    NRF_MODEM_DECT_MAC_ASSOCIATION_INDICATION_STATUS_SUCCESS) {
				dect_nrf91_utils_modem_association_ind_err_to_string(params->status,
										     tmp_str);
				LOG_ERR("Association indication with err %s (%d) with long RD ID: "
					"0x%X",
					tmp_str, params->status, params->long_rd_id);
				break;
			}
			LOG_INF("New child: association with long RD ID: %u (0x%X)",
				params->long_rd_id, params->long_rd_id);

			dect_nrf91_child_association_created(params->long_rd_id);
			break;
		}
		case DECT_NRF91_CTRL_OP_MDM_ASSOCIATION_RESP: {
			struct nrf_modem_dect_mac_association_cb_params *params = event.data;
			struct dect_nrf91_settings *set_ptr = dect_nrf91_settings_ref_get();
			struct dect_network_status_evt network_status_data = {
				.network_status = DECT_NETWORK_STATUS_FAILURE,
				.dect_err_cause = dect_nrf91_utils_modem_status_to_net_mgmt_status(
					params->status),
			};

			/* Association response only with PT devices */
			__ASSERT_NO_MSG(set_ptr->net_mgmt_common.device_type ==
					DECT_DEVICE_TYPE_PT);
			if (params->status != NRF_MODEM_DECT_MAC_STATUS_OK) {
				/* Modem operation failed */
				dect_mgmt_association_req_failed_mdm_result_evt(
					ctrl_data.iface,
					params->long_rd_id,
					network_status_data.dect_err_cause);
				dect_mgmt_network_status_evt(ctrl_data.iface, network_status_data);

