jhirsi/sdk-nrf/drivers/dect_nrp/nrf91_mac/dect_nrf91_ctrl.c
				ctrl_data.configure_params.auto_start = false;
				if (ctrl_data.ass_config.pt_association_state !=
					CTRL_PT_ASSOCIATION_STATE_ASSOCIATED) {
					ctrl_data.ass_config.pt_association_state =
						CTRL_PT_ASSOCIATION_STATE_NONE;
				}

				dect_nrf91_utils_modem_mac_err_to_string(params->status, tmp_str);
				LOG_ERR("Modem operation failed for Association Response with "
					"err %s (%d) with long RD ID: 0x%X",
					tmp_str, params->status, params->long_rd_id);
				break;
			}

			if (!params->flags.has_association_response) {
				dect_mgmt_association_req_rejected_result_evt(
					ctrl_data.iface,
					params->long_rd_id,
					DECT_MAC_ASSOCIATION_NO_RESPONSE,
					DECT_MAC_ASSOCIATION_REJECT_TIME_60S);

				dect_mgmt_network_status_evt(ctrl_data.iface, network_status_data);
				LOG_ERR("Association response with no actual response with long RD "
					"ID: 0x%X",
					params->long_rd_id);
			} else if (!params->association_response.ack_status) {
				/* Association rejected */
				LOG_INF("Association rejected with long RD ID: %u (0x%X), cause %d",
					params->long_rd_id, params->long_rd_id,
					params->association_response.reject_cause);

				dect_mgmt_association_req_rejected_result_evt(
					ctrl_data.iface,
					params->long_rd_id,
					params->association_response.reject_cause,
					params->association_response.reject_time);
			} else {
				LOG_INF("New parent: association with long RD ID: %u (0x%X)",
					params->long_rd_id, params->long_rd_id);

				ctrl_data.configure_params.auto_start = false;
				ctrl_data.ass_config.pt_association_state =
					CTRL_PT_ASSOCIATION_STATE_ASSOCIATED;
				dect_nrf91_parent_association_created(params->long_rd_id,
								      params->ipv6_config);
			}
			break;
		}
		case DECT_NRF91_CTRL_OP_MDM_ASSOCIATION_RELEASE_RESP: {
			struct nrf_modem_dect_mac_association_release_cb_params *params =
				event.data;
			struct dect_nrf91_settings *set_ptr = dect_nrf91_settings_ref_get();

			LOG_INF("Association released with long RD ID: %u (0x%08x)",
				params->long_rd_id, params->long_rd_id);

			if (ctrl_data.ass_config.pt_association_state ==
			    CTRL_PT_ASSOCIATION_STATE_ASSOCIATED) {
				ctrl_data.ass_config.pt_association_state =
					CTRL_PT_ASSOCIATION_STATE_NONE;
				dect_nrf91_parent_association_removed(
					params->long_rd_id, ctrl_data.last_rel_cause, false);
			} else if (set_ptr->net_mgmt_common.device_type == DECT_DEVICE_TYPE_FT) {
				dect_nrf91_child_association_removed(
					params->long_rd_id, ctrl_data.last_rel_cause, false);
			}
			break;
		}
		case DECT_NRF91_CTRL_OP_MDM_ASSOCIATION_RELEASE_IND: {
			struct nrf_modem_dect_mac_association_release_ntf_cb_params *params =
				event.data;
			struct dect_nrf91_settings *set_ptr = dect_nrf91_settings_ref_get();

			LOG_INF("Release req received and association released with long RD ID: "
				"%u (0x%X)",
				params->long_rd_id, params->long_rd_id);

			if (set_ptr->net_mgmt_common.device_type == DECT_DEVICE_TYPE_FT) {
				dect_nrf91_child_association_removed(
					params->long_rd_id, params->release_cause, true);
			} else {
				/* Network kicked us out? */
				ctrl_data.ass_config.pt_association_state =
					CTRL_PT_ASSOCIATION_STATE_NONE;
				dect_nrf91_parent_association_removed(
					params->long_rd_id, params->release_cause, true);
			}
			break;
		}
		case DECT_NRF91_CTRL_OP_MDM_IPV6_CONFIG_CHANGED: {
			struct nrf_modem_dect_mac_ipv6_config_update_ntf_cb_params *params =
				event.data;

			LOG_WRN("IPv6 config changed, type: %d", params->ipv6_config.type);
			if (ctrl_data.ass_config.pt_association_state ==
			    CTRL_PT_ASSOCIATION_STATE_ASSOCIATED) {
				dect_nrf91_parent_association_ipv6_config_changed(
					params->ipv6_config);
			} else {
				LOG_WRN("IPv6 config changed. Not associated - ignored ");
			}
			break;
		}

		default:
			LOG_WRN("DECT NRF91 CTRL: Unknown event %u received", event.id);
			break;
		}
		k_free(event.data);
	}
}

#define DECT_NRF91_CTRL_STACK_SIZE CONFIG_DECT_NRP_MAC_NRF_CTRL_THREAD_STACK_SIZE
#define DECT_NRF91_CTRL_PRIORITY   K_PRIO_COOP(9) /* -7 */

K_THREAD_DEFINE(dect_nrf91_ctrl_msgq_th, DECT_NRF91_CTRL_STACK_SIZE,
		dect_nrf91_ctrl_msgq_thread_handler, NULL, NULL, NULL, DECT_NRF91_CTRL_PRIORITY, 0,
		0);

/**************************************************************************************************/

static void
dect_nrf91_ctrl_mdm_cfun_cb(struct nrf_modem_dect_mac_control_functional_mode_cb_params *params)
{
	dect_nrf91_ctrl_msgq_data_op_add(DECT_NRF91_CTRL_OP_MDM_CFUN_RESP, &params->status,
					 sizeof(params->status));
}

static void
dect_nrf91_ctrl_mdm_configure_cb(struct nrf_modem_dect_mac_control_configure_cb_params *params)
{
	dect_nrf91_ctrl_msgq_data_op_add(DECT_NRF91_CTRL_OP_MDM_CONFIGURE_RESP, &params->status,
					 sizeof(params->status));
}

static void
dect_nrf91_ctrl_mdm_systemmode_cb(struct nrf_modem_dect_mac_control_systemmode_cb_params *params)
{
	k_sem_give(&dect_mac_libmodem_api_sema);
}

static void
dect_nrf91_ctrl_mdm_capability_ntf_cb(struct nrf_modem_dect_mac_capability_ntf_cb_params *params)
{
	dect_nrf91_ctrl_msgq_data_op_add(
		DECT_NRF91_CTRL_OP_MDM_CAPABILITIES, params,
		sizeof(struct nrf_modem_dect_mac_capability_ntf_cb_params));
}

static void dect_nrf91_ctrl_mdm_rssi_scan_cb(struct nrf_modem_dect_mac_rssi_scan_cb_params *params)
{
	dect_nrf91_ctrl_msgq_data_op_add(DECT_NRF91_CTRL_OP_MDM_RSSI_COMPLETE, &params->status,
					 sizeof(params->status));
}

static void
dect_nrf91_ctrl_mdm_rssi_scan_ntf_cb(struct nrf_modem_dect_mac_rssi_scan_ntf_cb_params *params)
{
	struct dect_nrf91_ctrl_rssi_measurement_data_evt evt_data;

	__ASSERT_NO_MSG(params->rssi_meas_array_size == DECT_NRF91_RSSI_MEAS_ARR_SIZE);
	evt_data.rssi_result.channel = params->channel;
	evt_data.rssi_result.busy_percentage = params->busy_percentage;

	for (int i = 0; i < params->rssi_meas_array_size; i++) {
		if (i >= DECT_NRF91_RSSI_MEAS_ARR_SIZE) {
			printk("Too many RSSI measurements, max %d", DECT_NRF91_RSSI_MEAS_ARR_SIZE);
			break;
		}
		evt_data.rssi_result.busy[i] = params->busy[i];
		evt_data.rssi_result.possible[i] = params->possible[i];
		evt_data.rssi_result.free[i] = params->free[i];
	}

	dect_nrf91_ctrl_msgq_data_op_add(DECT_NRF91_CTRL_OP_MDM_RSSI_RESULT, &evt_data,
					 sizeof(struct dect_nrf91_ctrl_rssi_measurement_data_evt));
}

static void
dect_nrf91_ctrl_mdm_rssi_scan_stop_cb(struct nrf_modem_dect_mac_rssi_scan_stop_cb_params *params)
{
	dect_nrf91_ctrl_msgq_data_op_add(DECT_NRF91_CTRL_OP_MDM_RSSI_STOPPED, &params->status,
					 sizeof(params->status));
}

static void dect_nrf91_ctrl_mdm_cluster_configure_cb(
	struct nrf_modem_dect_mac_cluster_configure_cb_params *params)
{
	dect_nrf91_ctrl_msgq_data_op_add(DECT_NRF91_CTRL_OP_CLUSTER_CONFIG_RESP, &params->status,
					 sizeof(params->status));
}

static void dect_nrf91_ctrl_mdm_cluster_ch_load_change_ntf_cb(
	struct nrf_modem_dect_mac_cluster_ch_load_change_ntf_cb_params *params)
{
	dect_nrf91_ctrl_msgq_data_op_add(
		DECT_NRF91_CTRL_OP_CLUSTER_CH_LOAD_CHANGED, params,
		sizeof(struct nrf_modem_dect_mac_cluster_ch_load_change_ntf_cb_params));
}

static void dect_nrf91_ctrl_mdm_neighbor_inactivity_ntf_cb(
	struct nrf_modem_dect_mac_neighbor_inactivity_ntf_cb_params *params)
{
	dect_nrf91_ctrl_msgq_data_op_add(
		DECT_NRF91_CTRL_OP_NEIGHBOR_INACTIVITY, params,
		sizeof(struct nrf_modem_dect_mac_neighbor_inactivity_ntf_cb_params));
}

static void dect_nrf91_ctrl_mdm_network_beacon_configure_cb(
	struct nrf_modem_dect_mac_network_beacon_configure_cb_params *params)
{
	dect_nrf91_ctrl_msgq_data_op_add(DECT_NRF91_CTRL_OP_MDM_NW_BEACON_START_OR_STOP_DONE,
					 &params->status, sizeof(params->status));
}

static void
dect_nrf91_ctrl_mdm_association_ntf_cb(struct nrf_modem_dect_mac_association_ntf_cb_params *params)
{
	dect_nrf91_ctrl_msgq_data_op_add(
		DECT_NRF91_CTRL_OP_MDM_ASSOCIATION_IND, params,
		sizeof(struct nrf_modem_dect_mac_association_ntf_cb_params));
}

