jhirsi/sdk-nrf/drivers/dect_nrp/nrf91_mac/dect_nrf91_ctrl.c
static void dect_nrf91_ctrl_mdm_association_release_ntf_cb(
	struct nrf_modem_dect_mac_association_release_ntf_cb_params *params)
{
	dect_nrf91_ctrl_msgq_data_op_add(
		DECT_NRF91_CTRL_OP_MDM_ASSOCIATION_RELEASE_IND, params,
		sizeof(struct nrf_modem_dect_mac_association_release_ntf_cb_params));
}

static void
dect_nrf91_ctrl_mdm_network_scan_cb(struct nrf_modem_dect_mac_network_scan_cb_params *params)
{
	dect_nrf91_ctrl_msgq_data_op_add(DECT_NRF91_CTRL_OP_MDM_NW_SCAN_COMPLETE, params,
					 sizeof(struct nrf_modem_dect_mac_network_scan_cb_params));
}

static void dect_nrf91_ctrl_mdm_cluster_beacon_ntf_cb(
	struct nrf_modem_dect_mac_cluster_beacon_ntf_cb_params *params)
{
	dect_nrf91_ctrl_msgq_data_op_add(
		DECT_NRF91_CTRL_OP_MDM_CLUSTER_BEACON_RCVD, params,
		sizeof(struct nrf_modem_dect_mac_cluster_beacon_ntf_cb_params));
}

static void dect_nrf91_ctrl_mdm_network_beacon_ntf_cb(
	struct nrf_modem_dect_mac_network_beacon_ntf_cb_params *params)
{
	dect_nrf91_ctrl_msgq_data_op_add(
		DECT_NRF91_CTRL_OP_MDM_NW_BEACON_RCVD, params,
		sizeof(struct nrf_modem_dect_mac_network_beacon_ntf_cb_params));
}

static void dect_nrf91_ctrl_mdm_network_scan_stop_cb(
	struct nrf_modem_dect_mac_network_scan_stop_cb_params *params)
{
	dect_nrf91_ctrl_msgq_data_op_add(DECT_NRF91_CTRL_OP_MDM_NW_SCAN_STOPPED, &params->status,
					 sizeof(params->status));
}

static void dect_nrf91_ctrl_mdm_cluster_beacon_receive_cb(
	struct nrf_modem_dect_mac_cluster_beacon_receive_cb_params *params)
{
	dect_nrf91_ctrl_msgq_data_op_add(DECT_NRF91_CTRL_OP_MDM_CLUSTER_RCV_COMPLETE,
					 &params->cluster_status[0],
					 sizeof(params->cluster_status[0]));
}

static void
dect_nrf91_ctrl_mdm_association_cb(struct nrf_modem_dect_mac_association_cb_params *params)
{
	dect_nrf91_ctrl_msgq_data_op_add(DECT_NRF91_CTRL_OP_MDM_ASSOCIATION_RESP, params,
					 sizeof(struct nrf_modem_dect_mac_association_cb_params));
}

static void dect_nrf91_ctrl_mdm_association_release_cb(
	struct nrf_modem_dect_mac_association_release_cb_params *params)
{
	dect_nrf91_ctrl_msgq_data_op_add(
		DECT_NRF91_CTRL_OP_MDM_ASSOCIATION_RELEASE_RESP, params,
		sizeof(struct nrf_modem_dect_mac_association_release_cb_params));
}

static void
dect_nrf91_ctrl_mdm_dlc_data_rx_ntf_cb(struct nrf_modem_dect_dlc_data_rx_ntf_cb_params *params)
{
	struct net_pkt *rcv_pkt;

	rcv_pkt = net_pkt_rx_alloc_with_buffer(ctrl_data.iface, params->data_len, AF_UNSPEC, 0,
					       K_NO_WAIT);
	if (!rcv_pkt) {
		printk("%s: cannot allocate rcv packet of len %d\n", (__func__), params->data_len);
		return;
	}
	if (net_pkt_write(rcv_pkt, params->data, params->data_len) < 0) {
		printk("%s: cannot write rcv packet of len %d\n", (__func__), params->data_len);
		net_pkt_unref(rcv_pkt);
		return;
	}
	struct dect_nrf91_ctrl_dlc_rx_data_with_pkt_ptr mdm_dlc_data_with_pkt_ptr_params;

	mdm_dlc_data_with_pkt_ptr_params.mdm_params = *params;
	mdm_dlc_data_with_pkt_ptr_params.data_len = params->data_len;
	mdm_dlc_data_with_pkt_ptr_params.iface = ctrl_data.iface;
	mdm_dlc_data_with_pkt_ptr_params.pkt = rcv_pkt;
	dect_nrf91_rx_msgq_data_op_add(DECT_NRF91_RX_OP_RX_DATA_WITH_PKT_PTR,
				       (void *)&mdm_dlc_data_with_pkt_ptr_params,
				       sizeof(struct dect_nrf91_ctrl_dlc_rx_data_with_pkt_ptr));
}

static void dect_nrf91_ctrl_mdm_dlc_data_tx_cb(struct nrf_modem_dect_dlc_data_tx_cb_params *params)
{
	struct dect_nrf91_ctrl_dlc_data_tx_resp_evt evt_data;

	evt_data.status = params->status;
	evt_data.long_rd_id = params->long_rd_id;
	evt_data.flow_id = params->flow_id;
	evt_data.num_acked_data = 1;
	evt_data.acked_data[0].transaction_id = params->transaction_id;

	dect_nrf91_ctrl_msgq_data_op_add(DECT_NRF91_CTRL_OP_MDM_DLC_DATA_RESP, &evt_data,
					 sizeof(struct dect_nrf91_ctrl_dlc_data_tx_resp_evt));
}

static void
dect_nrf91_ctrl_mdm_cluster_info_ntf_cb(struct nrf_modem_dect_mac_cluster_info_cb_params *params)
{
	dect_nrf91_ctrl_msgq_data_op_add(DECT_NRF91_CTRL_OP_MDM_CLUSTER_INFO, params,
					 sizeof(struct nrf_modem_dect_mac_cluster_info_cb_params));
}

static void
dect_nrf91_ctrl_mdm_neighbor_info_cb(struct nrf_modem_dect_mac_neighbor_info_cb_params *params)
{
	dect_nrf91_ctrl_msgq_data_op_add(DECT_NRF91_CTRL_OP_MDM_NEIGHBOR_INFO, params,
					 sizeof(struct nrf_modem_dect_mac_neighbor_info_cb_params));
}

BUILD_ASSERT(DECT_NRF91_MAX_NEIGHBOR_LIST_COUNT == DECT_L2_MAX_NEIGHBOR_LIST_ITEM_COUNT,
	     "Neighbor list size mismatch between DECT L2 and DECT NRF91");
static void
dect_nrf91_ctrl_mdm_neighbor_list_cb(struct nrf_modem_dect_mac_neighbor_list_cb_params *params)
{
	struct dect_nrf91_ctrl_neighbor_list_resp_evt evt_data;

	evt_data.status = params->status;
	evt_data.num_neighbors = params->num_neighbors;
	for (int i = 0; i < params->num_neighbors; i++) {
		if (i >= DECT_NRF91_MAX_NEIGHBOR_LIST_COUNT) {
			printk("Too many neighbors, only first %d will be used, "
				"long RD ID %u dropped first\n",
			       DECT_NRF91_MAX_NEIGHBOR_LIST_COUNT,
			       params->long_rd_ids[i]);
			evt_data.num_neighbors = DECT_NRF91_MAX_NEIGHBOR_LIST_COUNT;
			break;
		}
		evt_data.neighbor_long_rd_ids[i] = params->long_rd_ids[i];
	}

	dect_nrf91_ctrl_msgq_data_op_add(DECT_NRF91_CTRL_OP_MDM_NEIGHBOR_LIST, &evt_data,
					 sizeof(struct dect_nrf91_ctrl_neighbor_list_resp_evt));
}

static void dect_nrf91_ctrl_mdm_flow_control_ntf_cb(
	struct nrf_modem_dect_dlc_flow_control_ntf_cb_params *params)
{
	dect_nrf91_ctrl_msgq_data_op_add(
		DECT_NRF91_CTRL_OP_MDM_FLOW_CONTROL, params,
		sizeof(struct nrf_modem_dect_dlc_flow_control_ntf_cb_params));
}

static void
dect_nrf91_ctrl_mdm_dlc_data_discard_cb(struct nrf_modem_dect_dlc_data_discard_cb_params *params)
{
	printk("Data discard completed, status: %hu\n", params->status);
}

static void dect_nrf91_ctrl_mdm_cluster_beacon_receive_stop_cb(
	struct nrf_modem_dect_mac_cluster_beacon_receive_stop_cb_params *params)
{
	printk("Cluster beacon stop completed, status: %hu\n", params->status);
}

static void dect_nrf91_ctrl_mdm_neighbor_paging_failure_ntf_cb(
	struct nrf_modem_dect_mac_neighbor_paging_failure_ntf_cb_params *params)
{
	dect_nrf91_ctrl_msgq_data_op_add(
		DECT_NRF91_CTRL_OP_NEIGHBOR_PAGING_FAILURE, params,
		sizeof(struct nrf_modem_dect_mac_neighbor_paging_failure_ntf_cb_params));

