jhirsi/sdk-nrf/drivers/dect_nrp/nrf91_mac/dect_nrf91_ctrl.c
}

static void dect_nrf91_ctrl_mdm_cluster_beacon_rx_fail_ntf_cb(
	struct nrf_modem_dect_mac_cluster_beacon_rx_failure_ntf_cb_params *params)
{
	dect_nrf91_ctrl_msgq_data_op_add(
		DECT_NRF91_CTRL_OP_CLUSTER_BEACON_RX_FAILURE, params,
		sizeof(struct nrf_modem_dect_mac_cluster_beacon_rx_failure_ntf_cb_params));
}

static void dect_nrf91_ctrl_mdm_ipv6_config_changed_ntf_cb(
	struct nrf_modem_dect_mac_ipv6_config_update_ntf_cb_params *params)
{
	dect_nrf91_ctrl_msgq_data_op_add(
		DECT_NRF91_CTRL_OP_MDM_IPV6_CONFIG_CHANGED, params,
		sizeof(struct nrf_modem_dect_mac_ipv6_config_update_ntf_cb_params));
}

static const struct nrf_modem_dect_mac_ntf_callbacks mac_ntf_callbacks = {
	.association_ntf = dect_nrf91_ctrl_mdm_association_ntf_cb,
	.association_release_ntf = dect_nrf91_ctrl_mdm_association_release_ntf_cb,
	.cluster_ch_load_change_ntf = dect_nrf91_ctrl_mdm_cluster_ch_load_change_ntf_cb,
	.neighbor_inactivity_ntf = dect_nrf91_ctrl_mdm_neighbor_inactivity_ntf_cb,
	.neighbor_paging_failure_ntf = dect_nrf91_ctrl_mdm_neighbor_paging_failure_ntf_cb,
	.rssi_scan_ntf = dect_nrf91_ctrl_mdm_rssi_scan_ntf_cb,
	.cluster_beacon_ntf = dect_nrf91_ctrl_mdm_cluster_beacon_ntf_cb,
	.network_beacon_ntf = dect_nrf91_ctrl_mdm_network_beacon_ntf_cb,
	.dlc_data_rx_ntf = dect_nrf91_ctrl_mdm_dlc_data_rx_ntf_cb,
	.capability_ntf = dect_nrf91_ctrl_mdm_capability_ntf_cb,
	.cluster_beacon_rx_failure_ntf = dect_nrf91_ctrl_mdm_cluster_beacon_rx_fail_ntf_cb,
	.dlc_flow_control_ntf = dect_nrf91_ctrl_mdm_flow_control_ntf_cb,
	.ipv6_config_update_ntf = dect_nrf91_ctrl_mdm_ipv6_config_changed_ntf_cb,
};

static const struct nrf_modem_dect_mac_op_callbacks mac_op_callbacks = {

	.control_functional_mode = dect_nrf91_ctrl_mdm_cfun_cb,
	.control_configure = dect_nrf91_ctrl_mdm_configure_cb,
	.control_systemmode = dect_nrf91_ctrl_mdm_systemmode_cb,
	.association = dect_nrf91_ctrl_mdm_association_cb,
	.association_release = dect_nrf91_ctrl_mdm_association_release_cb,
	.cluster_beacon_receive = dect_nrf91_ctrl_mdm_cluster_beacon_receive_cb,
	.cluster_beacon_receive_stop = dect_nrf91_ctrl_mdm_cluster_beacon_receive_stop_cb,
	.cluster_configure = dect_nrf91_ctrl_mdm_cluster_configure_cb,
	.cluster_info = dect_nrf91_ctrl_mdm_cluster_info_ntf_cb,
	.neighbor_info = dect_nrf91_ctrl_mdm_neighbor_info_cb,
	.neighbor_list = dect_nrf91_ctrl_mdm_neighbor_list_cb,
	.dlc_data_tx = dect_nrf91_ctrl_mdm_dlc_data_tx_cb,
	.dlc_data_discard = dect_nrf91_ctrl_mdm_dlc_data_discard_cb,
	.network_beacon_configure = dect_nrf91_ctrl_mdm_network_beacon_configure_cb,
	.network_scan = dect_nrf91_ctrl_mdm_network_scan_cb,
	.network_scan_stop = dect_nrf91_ctrl_mdm_network_scan_stop_cb,
	.rssi_scan = dect_nrf91_ctrl_mdm_rssi_scan_cb,
	.rssi_scan_stop = dect_nrf91_ctrl_mdm_rssi_scan_stop_cb,
};

static void dect_nrf91_ctrl_mac_init(void)
{
	LOG_INF("Starting DECT NR+ Stack initialization");

	int ret = nrf_modem_dect_mac_callback_set(&mac_op_callbacks, &mac_ntf_callbacks);

	if (ret != 0) {
		printk("Error in callback set, error: %d\n", ret);
	}

	/* TODO: init need to be changed, we will need to enable also MODE_PHY with dect_shell for
	 * certification
	 */
	ret = nrf_modem_dect_control_systemmode_set(NRF_MODEM_DECT_MODE_MAC);
	if (ret != 0) {
		printk("Error in systemmode set, error: %d\n", ret);
	}

	/* Wait that sysmode is set */
	ret = k_sem_take(&dect_mac_libmodem_api_sema, K_SECONDS(2));

	if (ret) {
		printk("(%s): nrf_modem_dect_control_systemmode_set() timeout.\n", (__func__));
	}
	ctrl_data.mdm_activation_state = CTRL_MDM_DEACTIVATED;
	net_if_carrier_off(ctrl_data.iface);

	(void)dect_nrf91_ctrl_modem_configure_req_from_settings();

	ret = k_sem_take(&dect_mac_libmodem_api_sema, K_SECONDS(2));
	if (ret) {
		printk("(%s): modem configure timeout.\n", (__func__));
	}
}

/**************************************************************************************************/

struct nrf_modem_dect_mac_capability_ntf_cb_params
	*dect_nrf91_ctrl_api_mdm_capabilities_ref_get(void)
{
	return &ctrl_data.mdm_capas;
}

static void dect_nrf91_ctrl_on_modem_lib_init(int ret, void *ctx)
{
	ARG_UNUSED(ret);
	ARG_UNUSED(ctx);

	dect_nrf91_ctrl_mac_init();
}

NRF_MODEM_LIB_ON_INIT(dect_nrf91_ctrl_api_init_hook, dect_nrf91_ctrl_on_modem_lib_init, NULL);

int dect_nrf91_ctrl_api_init(struct net_if *iface)
{
	__ASSERT_NO_MSG(iface);
	memset(&ctrl_data, 0, sizeof(struct dect_nrf91_ctrl_data));

	ctrl_data.iface = iface;
	net_if_carrier_off(ctrl_data.iface);
	LOG_DBG("dect_nrf91_ctrl_api_init");

	return 0;
}
